{
  "Curriculo_em_Movimento_do_Novo_Ensino_Medio": {
    "Orientacoes_gerais_do_documento": {
      "Apresentacao": "A partir da homologação, em dezembro de 2018, da Base Nacional Comum Curricular (BNCC) (BRASIL, 20184), teve início o processo de revisitação do Currículo em Movimento do Ensino Médio do Distrito Federal (DISTRITO FEDERAL, 2014a,b). Em outubro de 2019, foi apresentada à consulta pública a primeira versão do documento revisitado. Deste amplo processo de participação popular, foi gerada a segunda versão do documento, finalizada ainda em 2019 e implementada em cinco Unidades Escolares-Piloto do Novo Ensino Médio. Desde então, duas outras versões foram elaboradas: a terceira versão, realizada a partir da compilação das contribuições oriundas do processo de leitura crítica, realizado no primeiro semestre de 2020, e que contou com a participação de setores diversos da sociedade, tais como a Universidade de Brasília (UnB), Instituto Federal de Brasília (IFB), entidades representativas de classes, entre outros. E esta quarta versão, em caráter definitivo, editada a partir do segundo processo de consulta pública realizado entre agosto e novembro também de 2020.",
      "Organizacao_do_documento": "Resultado deste trabalho, construído de forma colaborativa, este documento curricular, será o Referencial Curricular para o Ensino Médio do Sistema de Ensino do Distrito Federal e currículo obrigatório para a Rede Pública, e está organizado em seis capítulos principais."
    },
    "Competencias_Gerais_do_Novo_Ensino_Medio": {
      "descricao": "Competências gerais da BNCC aplicadas ao Ensino Médio",
      "Competencias_Gerais_da_Educacao_Basica": [
        "Valorizar e utilizar os conhecimentos historicamente construídos sobre o mundo físico, social, cultural e digital para entender e explicar a realidade, continuar aprendendo e colaborar para a construção de uma sociedade justa, democrática e inclusiva.",
        "Exercitar a curiosidade intelectual e recorrer à abordagem própria das ciências, incluindo a investigação, a reflexão, a análise crítica, a imaginação e a criatividade, para investigar causas, elaborar e testar hipóteses, formular e resolver problemas e criar soluções (inclusive tecnológicas), com base nos conhecimentos das diferentes áreas.",
        "Valorizar e fruir as diversas manifestações artísticas e culturais, das locais às mundiais, e também participar de práticas diversificadas da produção artístico-cultural.",
        "Utilizar diferentes linguagens - verbal (oral ou visual-motora, como Libras, e escrita), corporal, visual, sonora e digital -, bem como conhecimentos das linguagens artística, matemática e científica, para se expressar e partilhar informações, experiências, ideias e sentimentos em diferentes contextos e produzir sentidos que levem ao entendimento mútuo.",
        "Compreender, utilizar e criar tecnologias digitais de informação e comunicação de forma crítica, significativa, reflexiva e ética nas diversas práticas sociais (incluindo as escolares) para se comunicar, acessar e disseminar informações, produzir conhecimentos, resolver problemas e exercer protagonismo e autoria na vida pessoal e coletiva.",
        "Valorizar a diversidade de saberes e vivências culturais e apropriar-se de conhecimentos e experiências que lhe possibilitem entender as relações próprias do mundo do trabalho e fazer escolhas alinhadas ao exercício da cidadania e ao seu projeto de vida, com liberdade, autonomia, consciência crítica e responsabilidade.",
        "Argumentar com base em fatos, dados e informações confiáveis, para formular, negociar e defender ideias, pontos de vista e decisões comuns que respeitem e promovam os direitos humanos, a consciência socioambiental e o consumo responsável em âmbito local, regional e global, com posicionamento ético em relação ao cuidado de si mesmo, dos outros e do planeta.",
        "Conhecer-se, apreciar-se e cuidar de sua saúde física e emocional, compreendendo-se na diversidade humana e reconhecendo suas emoções e as dos outros, com autocrítica e capacidade para lidar com elas.",
        "Exercitar a empatia, o diálogo, a resolução de conflitos e a cooperação, fazendo-se respeitar e promovendo o respeito ao outro e aos direitos humanos, com acolhimento e valorização da diversidade de indivíduos e de grupos sociais, seus saberes, suas identidades, culturas e potencialidades, sem preconceitos de qualquer natureza.",
        "Agir pessoal e coletivamente com autonomia, responsabilidade, flexibilidade, resiliência e determinação, tomando decisões com base em princípios éticos, democráticos, inclusivos, sustentáveis e solidários."
      ]
    },
    "Eixos_transversais": [
      "Eixos Transversais no Currículo em Movimento",
      "Educação para a Diversidade",
      "Cidadania e Educação em e para os Direitos Humanos",
      "Educação para a Sustentabilidade",
      "Temas Contemporâneos Transversais na BNCC",
      "Educação do Campo: Para Além de Eixo Transversal",
      "Protagonismo e Identidades",
      "Pesquisa e Iniciação Científica",
      "Educação Profissional e Tecnológica no Contexto Atual"
    ],
    "Projeto_de_Vida": {
      "Descricao_Geral": "Uma das inovações introduzidas na LDB, a partir de 2017, é a necessidade de que os currículos da Educação Básica ofereçam aos jovens oportunidades de construção de seus projetos de vida, visando qualificar a sua formação integral.",
      "Objetivos_de_Aprendizagem": {
        "1o_Semestre": {
          "Dimensao_Pessoal": "PV01 Identificar atitudes pessoais, buscando caminhos para persistir e manter o foco, mostrando-se confiável no cumprimento de tarefas com qualidade",
          "Dimensao_Social": "PV02 Construir mapa de rotina diária identificando emoções durante o percurso",
          "Dimensao_Organizacao_Planejamento_Acompanhamento": [
            "PV03 Compreender o valor do planejamento e da organização e estabelecer combinados e metas",
            "PV04 Refletir sobre pontos fortes e realizações pessoais, com base em estratégias de autoavaliação"
          ],
          "Dimensao_Profissional": "PV05 Compreender a importância das profissões e o impacto das atividades profissionais dos familiares em seus cotidianos"
        },
        "2o_Semestre": {
          "Dimensao_Pessoal": "PV06 Analisar atitudes pessoais, explorando novos caminhos para persistir e manter o foco, mostrando-se confiável no cumprimento de tarefas com qualidade",
          "Dimensao_Social": "PV07 Identificar pessoas presentes nos percursos diários e mapear a comunicação",
          "Dimensao_Organizacao_Planejamento_Acompanhamento": [
            "PV08 Utilizar estratégias para planejar e estabelecer metas pessoais e de aprendizagem, tendo em vista projetos presentes e futuros",
            "PV09 Acompanhar e mapear os pontos fortes e os enfrentamentos de desafios"
          ],
          "Dimensao_Profissional": "PV10 Identificar as tarefas que mais gosta e as que têm mais facilidade de desempenhar. Refletir sobre as profissões que considera interessantes"
        },
        "3o_Semestre": {
          "Dimensao_Pessoal": "PV11 Compreender o conceito de valores e crenças e identificá-los em seus cotidianos",
          "Dimensao_Social": "PV12 Participar de rodas de conversa, procurando compreender o tempo e as necessidades do outro",
          "Dimensao_Organizacao_Planejamento_Acompanhamento": [
            "PV13 Utilizar estratégias para planejar-se e estabelecer metas pessoais e de aprendizagem, tendo em vista projetos presentes e futuros",
            "PV14 Identificar resultados dos desafios pessoais e dos com base em estratégias de resolução de problemas e tomada de decisão"
          ],
          "Dimensao_Profissional": "PV15 Compreender o valor do trabalho para as pessoas e a sociedade e conhecer suas aptidões, identificando caminhos para fortalecer as que teme desenvolver as que gostaria de ter. Investigar sobre o cotidiano de profissões que julga interessantes"
        },
        "4o_Semestre": {
          "Dimensao_Pessoal": "PV16 Desenvolver hábitos saudáveis mentais e físicos e organizar o tempo",
          "Dimensao_Social": "PV17 Identificar necessidades cotidianas e criar possíveis soluções",
          "Dimensao_Organizacao_Planejamento_Acompanhamento": [
            "Pv18 Analisar criticamente estratégias de planejamento e organização, estabelecer e modificar metas de longo prazo e prioridades, exercitando-as em seus projetos presentes e futuros, em contextos pessoais, escolares e sociais, criando alternativas viáveis para o alcance de seus objetivos",
            "PV19 Analisar características pessoais e habilidades que contribuem ou limitam capacidade de realizar tarefas e enfrentar desafios"
          ],
          "Dimensao_Profissional": "PV20 Identificar as transformações ocorridas nas relações e no mundo do trabalho na contemporaneidade."
        },
        "5o_Semestre": {
          "Dimensao_Pessoal": "PV21 Lidar com estresse, frustração, fracasso e adversidade como parte do processo para alcançar metas acadêmicas e projetos presentes e futuros",
          "Dimensao_Social": "PV22 Considerar, refletir e construir novas atitudes e habilidades a partir da devolutiva de colegas, professores e outros pares e adultos",
          "Dimensao_Organizacao_Planejamento_Acompanhamento": [
            "PV23 Compreender o valor do esforço e do empenho para o alcance dos objetivos acadêmicos e projetos presentes e futuros",
            "PV24 Considerar e incorporar a devolutiva de colegas e professores"
          ],
          "Dimensao_Profissional": "PV25 Analisar aptidões e aspirações e assumir riscos e responsabilidades para realizar escolhas profissionais mais assertivas"
        },
        "6o_Semestre": {
          "Dimensao_Pessoal": "PV26 Desenvolver hábitos saudáveis como parte do processo para alcançar metas acadêmicas e projetos profissionais",
          "Dimensao_Social": "PV27 Trabalhar em grupo, de forma colaborativa, de maneira a empreender socialmente",
          "Dimensao_Organizacao_Planejamento_Acompanhamento": [
            "PV28 Alcançar e mapear objetivos, encarando obstáculos, desafios e adversidades como oportunidades de crescimento",
            "PV29 Elaborar mapa visual dos projetos presentes e futuros"
          ],
          "Dimensao_Profissional": "PV30 Identificar percursos para formação e inserção profissional e acessar oportunidades diversas de formação e inserção profissional"
        }
      }
    },
    "Avaliacao": {
      "Texto_Integral": "A avaliação configura-se como um dos pilares fundamentais do trabalho pedagógico da escola e da sala de aula e perpassa por todo o processo, estando presente desde o início até o final. Avaliação e aprendizagem caminham juntas no processo educativo..."
    },
    "Formacao_Geral_Basica": {
      "Descricao_Geral": "A Formação Geral Básica do estudante de Ensino Médio, no Sistema de Ensino do Distrito Federal, compreendendo até 1800 horas, constrói-se a partir das concepções da BNCC quanto às competências e habilidades essenciais que todo estudante brasileiro deve adquirir em seu percurso formativo durante a Educação Básica, de forma a possibilitar o aprofundamento e a consolidação das aprendizagens essenciais do Ensino Fundamental, a compreensão de problemas complexos e a reflexão sobre soluções para eles. Nesse sentido, as Diretrizes Curriculares Nacionais para o Ensino Médio definem aprendizagens essenciais como sendo aquelas que:\n\n[...] desenvolvem competências e habilidades entendidas como conhecimentos em ação, com significado para a vida, expressas em práticas cognitivas, profissionais e socioemocionais, atitudes e valores continuamente mobilizados, articulados e integrados, para resolver demandas complexas da vida cotidiana, do exercício da cidadania e da atuação no mundo do trabalho. (BRASIL, 2018b, p.21).\n\nPara resolver demandas complexas do dia a dia, exercer a cidadania e atuar no mundo do trabalho, torna-se imprescindível a perspectiva dialógica entre os saberes. Nela, a organização curricular parte de grandes áreas do conhecimento, e o trabalho interdisciplinar ganha efetividade a partir da interação entre os saberes específicos, ampliando as possibilidades da formação integral do estudante. Assim, a Formação Geral Básica é composta pelas seguintes áreas do conhecimento: Linguagens e suas Tecnologias, Matemática e suas Tecnologias, Ciências da Natureza e suas Tecnologias e Ciências Humanas e Sociais Aplicadas.\n\nNo Currículo em Movimento do Ensino Médio, as áreas de conhecimento estão estruturadas em torno de unidades temáticas e objetivos de aprendizagens interdisciplinares, que instigam e motivam o trabalho docente de forma cooperativa e dialógica. Busca-se mobilizar e articular, em um mesmo propósito, os conceitos (saberes e procedimentos), as habilidades (práticas, cognitivas e socioemocionais), as atitudes e os valores dos diversos componentes curriculares que norteiam o processo de ensino e aprendizagem na construção de conhecimentos que são fundamentais para a formação do estudante. Essa organização visa a superar fronteiras limitadoras e promover o compartilhamento de sentido, sem, no entanto, perder a particularidade do saber em cada campo de conhecimento.",
      "Linguagens_e_suas_Tecnologias": {
        "Objetivos_Gerais": [
          "favorecer a compreensão de diversificadas práticas de linguagem (multissemióticas e multimidiáticas) e práticas culturais (verbais, artísticas e corporais), promovendo a mobilização desses conhecimentos para o exercício reflexivo acerca de conteúdos informativos amplamente divulgados em mídias diversas, a fim de contribuir com a formação de um cidadão crítico, consciente, ético e protagonista, com elevado senso de identidade e de pertencimento social;",
          "promover o entendimento da importância da apropriação das práticas de linguagem, por meio da interação crítica com variadas mani-\n\nfestações linguísticas, corporais, artísticas e culturais, a fim de compreender a realidade e ampliar as possibilidades de atuação social, pautando-se pelos Direitos Humanos e pelos ideais de justiça social e democracia, repudiando quaisquer formas de preconceito;",
          "valorizar as diversas linguagens, abordando formas locais de expressão, estimulando o senso de pertença, a iniciativa e a autoria (respeitando-se a originalidade do texto), como instrumentos de apropriação da produção cultural coletiva e de participação social; e, ainda, promovendo a compreensão de cânones regionais, nacionais e mundiais de expressão, a fim de expandir as possibilidades de interação cultural;",
          "propiciar vivências de práticas corporais, estéticas e linguísticas que possibilitem a compreensão das variedades culturais em níveis local, regional, nacional e mundial, de modo a construir múltiplas possibilidades de interação com o conhecimento acumulado da humanidade, com a finalidade de compreender a relevância das práticas de linguagens para as diversas culturas e construir relações privadas de preconceitos;",
          "apreciar as manifestações linguísticas, estéticas e corporais presentes na cultura digital, analisando as potencialidades do meio digital para a produção e a divulgação de informações, exercitando a crítica aos conteúdos disponibilizados pelas mídias, a fim de interagir, de forma produtiva, com os conhecimentos publicizados digitalmente e estimular a contribuição autoral, dentro dos princípios da legalidade de autoria."
        ],
        "Objetivos_de_Aprendizagem_por_Unidade_Tematica": [
          {
            "Unidade_Tematica": "LINGUAGENS E SUAS TECNOLOGIAS EM CONTEXTOS E PRÁTICAS CULTURAIS",
            "Objetivos_de_Aprendizagem": [
              {
                "codigo": "LGG01FG",
                "descricao": "Distinguir os diversos tipos de textos de circulação cotidiana (jornalísticos, publicitários, epistolares, tirinhas, charges, resenhas, artigos de opinião, letras de música) que proporcionem uma maturidade quanto à prática cultural, a fim de propiciar criticidade tanto no uso dos textos quanto no seu processo de construção estrutural."
              },
              {
                "codigo": "LGG02FG",
                "descricao": "Sistematizar a estruturação de textos escritos e orais presentes na disseminação das práticas culturais contemporâneas (notícia, reportagem, relato, sinopse, resenha, entrevista, crônica editorial) a partir do estilo e da funcionalidade deles em diferentes situações de uso."
              },
              {
                "codigo": "LGG03FG",
                "descricao": "Comparar apresentações e comentários apreciativos e críticos, contidos em meios multimodais e multissemióticos, sobre as diversas manifestações culturais e artísticas do cenário cultural brasiliense."
              },
              {
                "codigo": "LGG04FG",
                "descricao": "Identificar conceitos de visão de mundo e expressão humana por meio das diferentes linguagens artísticas, verbais e corporais para avaliar diversos modos próprios de ser e pertencer culturalmente."
              },
              {
                "codigo": "LGG05FG",
                "descricao": "Reconhecer diferentes contextos e práticas de produção musical, tradicionais e contemporâneas, a fim de aprofundar e experimentar noções estéticas, linguísticas da música."
              },
              {
                "codigo": "LGG06FG",
                "descricao": "Comparar a construção de campos artísticos, conceitos estéticos e linguísticos sobre as artes cênicas e do espetáculo."
              },
              {
                "codigo": "LGG07FG",
                "descricao": "Identificar as produções e manifestações artístico-visuais de diferentes tempos e espaços, associando-as à contemporaneidade e às suas linguagens e tecnologias."
              },
              {
                "codigo": "LGG08FG",
                "descricao": "Examinar os contextos e práticas culturais da dança e seus desdobramentos artísticos, linguísticos e esportivos."
              },
              {
                "codigo": "LGG09FG",
                "descricao": "Reconhecer o circo como uma manifestação histórica e cultural, experimentando o conjunto de suas práticas."
              },
              {
                "codigo": "LGG10FG",
                "descricao": "Reconhecer a construção histórica e cronológica dos jogos coletivos e seus antecessores de diversas culturas."
              },
              {
                "codigo": "LGG11FG",
                "descricao": "Avaliar a construção das danças folclóricas e populares, seus objetivos, suas intenções e a contribuição de várias etnias."
              },
              {
                "codigo": "LGG12FG",
                "descricao": "Distinguir os roteiros culturais para a utilização de estratégias verbais e não verbais, na língua estrangeira."
              },
              {
                "codigo": "LGG13FG",
                "descricao": "Criar contextos multimodais de interação sociocultural sobre assuntos do cotidiano."
              },
              {
                "codigo": "LGG14FG",
                "descricao": "Avaliar, na língua estudada, diferentes gêneros textuais, verbais e não verbais, em culturas diversas."
              }
            ]
          },
          {
            "Unidade_Tematica": "LINGUAGENS E SUAS TECNOLOGIAS EM CONTEXTOS E PRÁTICAS SOCIAIS",
            "Objetivos_de_Aprendizagem": [
              {
                "codigo": "LGG15FG",
                "descricao": "Observar a relação existente entre língua e linguagem a partir de diferentes manifestações sociais contidas em textos multimodais."
              },
              {
                "codigo": "LGG16FG",
                "descricao": "Aplicar os recursos expressivos da linguagem não verbal em relação à linguagem verbal."
              },
              {
                "codigo": "LGG17FG",
                "descricao": "Formular hipóteses com criticidade de assuntos de notoriedade nacional e do Distrito Federal."
              },
              {
                "codigo": "LGG18FG",
                "descricao": "Selecionar ferramentas de apoio para apresentações orais adequadas."
              },
              {
                "codigo": "LGG19FG",
                "descricao": "Analisar a invenção do “índio” no cinema, na dança, na música e nas demais composições artísticas e verbais."
              },
              {
                "codigo": "LGG20FG",
                "descricao": "Comparar conhecimentos historicamente acumulados no desenvolvimento das linguagens com as práticas sociais contemporâneas."
              },
              {
                "codigo": "LGG21FG",
                "descricao": "Examinar esferas de produção, formação de público, circulação e manutenção de práticas sociais no Distrito Federal e no Entorno."
              },
              {
                "codigo": "LGG22FG",
                "descricao": "Experimentar jogos cooperativos, jogos de integração e jogos de tabuleiro."
              },
              {
                "codigo": "LGG23FG",
                "descricao": "Aplicar o conjunto de práticas corporais diversificadas em diferentes espaços de atividade física."
              },
              {
                "codigo": "LGG24FG",
                "descricao": "Desenvolver o conhecimento sobre a história e as concepções das lutas de diversas origens."
              },
              {
                "codigo": "LGG25FG",
                "descricao": "Examinar sons e entonações específicos da língua estrangeira estudada."
              },
              {
                "codigo": "LGG26FG",
                "descricao": "Desenvolver a comunicação, em língua estrangeira, de forma clara, coerente e persuasiva."
              },
              {
                "codigo": "LGG27FG",
                "descricao": "Compilar informações acerca das implicações dos processos históricos e geopolíticos que envolvem os movimentos migratórios atuais."
              }
            ]
          },
          {
            "Unidade_Tematica": "LINGUAGENS E SUAS TECNOLOGIAS EM E PARA CONTEXTOS DE DIREITOS HUMANOS",
            "Objetivos_de_Aprendizagem": [
              {
                "codigo": "LGG28FG",
                "descricao": "Comparar, pela análise de suas linguagens, os processos de comunicação e informação legais existentes, no intuito de validar as mensagens transmitidas pela mídia e pelos meios de comunicação das instituições públicas e privadas."
              },
              {
                "codigo": "LGG29FG",
                "descricao": "Selecionar textos jornalísticos relacionados a questões étnico-raciais, violência verbal e física, inclusão social e defesa do consumidor."
              },
              {
                "codigo": "LGG30FG",
                "descricao": "Promover o letramento jurídico por meio da discussão de textos legislativos que discorram sobre os direitos individuais e coletivos da sociedade."
              },
              {
                "codigo": "LGG31FG",
                "descricao": "Formular hipóteses, a partir da apropriação do repertório sociocultural por meio de debates orientados em sala de aula."
              },
              {
                "codigo": "LGG32FG",
                "descricao": "Apreciar o Patrimônio Histórico, Artístico, Literário, Arquitetônico e Desportivo Nacional, Material e Imaterial."
              },
              {
                "codigo": "LGG33FG",
                "descricao": "Interpretar o silêncio como um modo de linguagem dos povos indígenas, africanos e afro-brasileiros."
              },
              {
                "codigo": "LGG34FG",
                "descricao": "Analisar conceitos estéticos por meio da crítica ao “blackface\" em cinema, teatro, televisão, tipologias textuais, composições musicais e corporais."
              },
              {
                "codigo": "LGG35FG",
                "descricao": "Reconhecer o legado estético e cultural dos povos africanos e afro-brasileiros, destacando a atuação e a contribuição de negros e negras em diferentes áreas do conhecimento."
              },
              {
                "codigo": "LGG36FG",
                "descricao": "Reconhecer a diversidade, singularidade e diferença de corpos em práticas artísticas, verbais, esportivas e socialmente performativas."
              },
              {
                "codigo": "LGG37FG",
                "descricao": "Reconhecer o significado da educação física, de conceitos como cultura corporal, de movimento como construção histórico-social."
              },
              {
                "codigo": "LGG38FG",
                "descricao": "Reconhecer o processo de construção do movimento olímpico e paralímpico, dos jogos indígenas."
              },
              {
                "codigo": "LGG39FG",
                "descricao": "Investigar na capoeira as relações de poder e resistência, sua construção a partir do cerceamento de direitos."
              },
              {
                "codigo": "LGG40FG",
                "descricao": "Formular hipóteses sobre as possibilidades de inclusão das diferenças étnico-raciais, de gênero, de orientação sexual, de idade e de cultura."
              },
              {
                "codigo": "LGG41FG",
                "descricao": "Posicionar-se, por meio da língua estrangeira, em defesa da diversidade de composições familiares."
              },
              {
                "codigo": "LGG42FG",
                "descricao": "Projetar alternativas para dirimir conflitos sociais oriundos de movimentos migratórios."
              }
            ]
          },
          {
            "Unidade_Tematica": "LINGUAGENS E SUAS TECNOLOGIAS EM CONTEXTOS SOCIOAMBIENTAIS",
            "Objetivos_de_Aprendizagem": [
              {
                "codigo": "LGG43FG",
                "descricao": "Averiguar o funcionamento de órgãos públicos normatizadores e fiscalizadores de questões ambientais."
              },
              {
                "codigo": "LGG44FG",
                "descricao": "Analisar as políticas públicas de combate às ocupações ilegais/desordenadas e às queimadas."
              },
              {
                "codigo": "LGG45FG",
                "descricao": "Posicionar-se, pelo uso de debates, acerca de questões socioambientais, indígenas, quilombolas e dos povos ciganos."
              },
              {
                "codigo": "LGG46FG",
                "descricao": "Verificar ações artísticas, desportivas, verbais e socioculturais que envolvem a preservação do meio ambiente."
              },
              {
                "codigo": "LGG47FG",
                "descricao": "Distinguir diferentes estilos e espaços cênicos, esportivos e de letramento para analisar a dinâmica de práticas sociais."
              },
              {
                "codigo": "LGG48FG",
                "descricao": "Comparar a espacialidade visual com práticas artísticas, esportivas, históricas e socioculturais."
              },
              {
                "codigo": "LGG49FG",
                "descricao": "Analisar a participação cidadã por meio do posicionamento crítico das teorias, práticas e relações estéticas."
              },
              {
                "codigo": "LGG50FG",
                "descricao": "Vivenciar práticas corporais praticadas em espaços naturais e espaços urbanos de forma crítica."
              },
              {
                "codigo": "LGG51FG",
                "descricao": "Contrastar as ações que envolvem o Brasil e os países que falam a língua estudada quanto a acordos internacionais."
              },
              {
                "codigo": "LGG52FG",
                "descricao": "Categorizar, na língua estudada, ações individuais e coletivas que possibilitem a reflexão sobre o trabalho voluntário."
              },
              {
                "codigo": "LGG53FG",
                "descricao": "Criar, utilizando a língua estudada, orientações para o desenvolvimento da sustentabilidade."
              }
            ]
          },
          {
            "Unidade_Tematica": "LINGUAGENS E SUAS TECNOLOGIAS EM CONTEXTOS DE IDENTIDADE E PROTAGONISMO JUVENIL",
            "Objetivos_de_Aprendizagem": [
              {
                "codigo": "LGG54FG",
                "descricao": "Criar registros digitais profissionais em diferentes linguagens para validar projetos de vida."
              },
              {
                "codigo": "LGG55FG",
                "descricao": "Posicionar-se em debates sobre temas de interesse da juventude, apropriando-se de bases legais."
              },
              {
                "codigo": "LGG56FG",
                "descricao": "Avaliar os valores culturais e humanos no patrimônio artístico, arquitetônico e literário."
              },
              {
                "codigo": "LGG57FG",
                "descricao": "Planejar, de forma colaborativa, a produção de projetos culturais e de entretenimento."
              },
              {
                "codigo": "LGG58FG",
                "descricao": "Desenvolver as etapas de produção da pesquisa científica a partir dos gêneros textuais envolvidos."
              },
              {
                "codigo": "LGG59FG",
                "descricao": "Selecionar procedimentos de checagem de fatos e informações veiculadas nos sistemas de comunicação."
              },
              {
                "codigo": "LGG60FG",
                "descricao": "Descobrir coletivos indígenas, negros, latino-americanos e outros grupos étnicos que fazem uso de expressões artísticas."
              },
              {
                "codigo": "LGG61FG",
                "descricao": "Distinguir danças e expressões brasileiras das matrizes culturais indígenas, africanas e afro-brasileiras."
              },
              {
                "codigo": "LGG62FG",
                "descricao": "Identificar conceitos sobre o corpo e discursos linguísticos presentes na expressividade corporal."
              },
              {
                "codigo": "LGG63FG",
                "descricao": "Utilizar processos criativos incorporados à corporeidade para desenvolver o repertório artístico e cultural."
              },
              {
                "codigo": "LGG64FG",
                "descricao": "Apreciar espetáculos e manifestações artísticas, verbais e desportivas."
              },
              {
                "codigo": "LGG65FG",
                "descricao": "Interpretar conceitos de atividade física, aptidão física, saúde e qualidade de vida."
              },
              {
                "codigo": "LGG66FG",
                "descricao": "Compreender conceitos de nutrição, suplementação, produtos anabolizantes e alimentação saudável."
              },
              {
                "codigo": "LGG67FG",
                "descricao": "Conhecer o conceito de imagem corporal e analisar criticamente os discursos midiáticos."
              },
              {
                "codigo": "LGG68FG",
                "descricao": "Experimentar novos processos de autoconhecimento através de técnicas do Yoga."
              },
              {
                "codigo": "LGG69FG",
                "descricao": "Empregar conhecimentos linguísticos e socioculturais para elaboração de projetos de vida."
              },
              {
                "codigo": "LGG70FG",
                "descricao": "Desenvolver a performance argumentativa em diferentes contextos de uso da língua estudada."
              },
              {
                "codigo": "LGG71FG",
                "descricao": "Construir textos multimidiáticos para divulgar conteúdos de interesse dos estudantes."
              }
            ]
          },
          {
            "Unidade_Tematica": "LINGUAGENS E SUAS TECNOLOGIAS EM CONTEXTOS DE CULTURA DIGITAL",
            "Objetivos_de_Aprendizagem": [
              {
                "codigo": "LGG72FG",
                "descricao": "Analisar as tecnologias da comunicação e da informação na vida pessoal e social dos jovens."
              },
              {
                "codigo": "LGG73FG",
                "descricao": "Planejar o uso das diversas plataformas digitais de forma ética."
              },
              {
                "codigo": "LGG74FG",
                "descricao": "Apreciar formas contemporâneas de publicidade em contexto digital."
              },
              {
                "codigo": "LGG75FG",
                "descricao": "Operar, de forma compartilhada, práticas culturais e sociais apoiadas em meios digitais."
              },
              {
                "codigo": "LGG76FG",
                "descricao": "Analisar gêneros audiovisuais e cinematográficos e suas relações com as linguagens."
              },
              {
                "codigo": "LGG77FG",
                "descricao": "Examinar a relação das produções artísticas da Área de Linguagens com o desenvolvimento digital."
              },
              {
                "codigo": "LGG78FG",
                "descricao": "Analisar Festivais de Música Popular Brasileira e produções do período da Ditadura Militar."
              },
              {
                "codigo": "LGG79FG",
                "descricao": "Avaliar o uso de aplicativos e softwares utilizados para promoção de atividades físicas."
              },
              {
                "codigo": "LGG80FG",
                "descricao": "Utilizar testes e avaliações físicas para compreender benefícios ao organismo humano."
              },
              {
                "codigo": "LGG81FG",
                "descricao": "Avaliar criticamente o processo histórico dos jogos eletrônicos."
              },
              {
                "codigo": "LGG82FG",
                "descricao": "Explorar tecnologias digitais dirigidas à atividade física, conhecidas como Exergames."
              },
              {
                "codigo": "LGG83FG",
                "descricao": "Analisar diferentes gêneros digitais com o objetivo de ampliar a capacidade de comunicação."
              },
              {
                "codigo": "LGG84FG",
                "descricao": "Explorar plataformas digitais que propiciem acesso ao acervo artístico-literário internacional."
              },
              {
                "codigo": "LGG85FG",
                "descricao": "Desenvolver recursos digitais utilizando a língua estudada para contribuir com o bem-estar da comunidade."
              }
            ]
          }
        ],
        "Arte": {
          "fundamentacao": [
            "A Arte compõe este Currículo por meio do estudo e das práticas de manifestações artísticas e culturais, em suas diversas linguagens - Artes Visuais, Teatro, Música e Dança -, além de abordar conhecimentos estéticos híbridos, como o Audiovisual, o Cinema, a Performance e o Circo, reconhecendo a influência dos recursos tecnológicos e digitais nas produções e recepções artísticas.",
            "Diante das noções possíveis, observa-se que a Arte pode mobilizar conhecimentos mediante a promoção da sensibilidade, da intuição, da emoção, da poesia, da corporeidade, da ludicidade e da provocação dos sentidos humanos, considerando, assim, as trocas e os encontros da experiência estética cultivada em práticas artístico-pedagógicas dos espaços educativos. Tal movimento pode revigorar o respeito e a reflexão sobre si, o outro e o mundo, assim como oportunizar uma leitura e releitura da realidade sociocultural, o que fortalece o sentimento de ser e pertencer diante da fluidez dinâmica, simbólica, imaginária e compartilhada de estéticas e contextos culturais diversos, em tempos reais, fictícios, presenciais e virtuais.",
            "As conquistas e os desdobramentos legais e pedagógicos são históricos e sedimentaram o componente curricular Arte, no Ensino Médio, desde a sua regulamentação, ainda enquanto “atividade educativa”, pela LDB de 1971 (Lei nº 5.692/71), passando por seu estabelecimento como componente curricular obrigatório, conforme a LDB de 1996 (Lei nº 9.394/1996), e a consolidação da inclusão das quatro linguagens artísticas nos curriculos da Educação Básica, a partir da Lei nº 13.278/2016. Nesse sentido, é válido indicar que as crescentes e consolidadas pesquisas, bem como os cursos de graduação e pós-graduação da área, fornecem elementos gnosiológicos atualizados para o desenvolvimento dos conhecimentos relativos ao componente curricular Arte. O processo de ensino e aprendizagem em diferentes contextos educativos conta com a necessária e contínua formação de professores aptos para atuar de acordo com a linguagem artística específica: Artes Visuais, Teatro, Música e Dança.",
            "Ademais, as quatro linguagens artísticas aqui apresentadas, emsie a priori, não buscam designar a multiplicidade de manifestações humanas e práticas estéticas existentes, mas apresentam conhecimentos próprios e diversos que as distinguem e multiplicam, considerando os seus desdobramentos e estudos particulares (VELOSO, 2016, p. 33). Na realidade, elas sugerem e explicitam, por si só, as possibilidades de tratamento dos diferentes conteúdos, processos composicionais e receptivos de expressões artísticas tradicionais e contemporâneas, justamente por suas interconexões com a diversidade e pluralidade cultural ainda preconizadas nas Orientações Curriculares para o Ensino Médio (BRASIL, 2006, p. 177).",
            "A proposta de objetivos de aprendizagem em Arte preceitua, portanto, além dos conhecimentos institucionalmente historiografados, os saberes e fazeres artísticos oriundos de culturas negras, africanas, afro-brasileiras, indígenas e de outros grupos étnicos - de diferentes tempos e espaços (BRASIL, 20084). Essa representatividade não indica apenas um ato de inclusão, mas de reconhecimento empírico, epistemológico e de direito de seus contextos e práticas incorporados à formação da Arte e Cultura brasileiras, na condição de aprendizagens essenciais (BRASIL, 2018a, p. 476).",
            "Nesse sentido, o componente Arte questiona a “invenção do índio” e revisita a construção da identidade brasileira a partir da concepção de diversas “Áfricas”, com o objetivo de promover o desenvolvimento de um olhar crítico e sensível para as influências que formam a cultura brasileira, enfatizando as produções artísticas e culturais de matrizes africanas e das mais de 300 etnias indígenas existentes no País. Entende-se, ainda, que isso confere valorização à herança sociocultural e simbólica — individual e coletiva - dos estudantes provenientes de diferentes realidades do Distrito Federal e do Entorno, com o objetivo de acolher seus conhecimentos prévios e garantir abordagens pedagógicas, por meio das linguagens artísticas, que vinculem a educação à prática social, segundo aponta a LDB, no inciso Il do artigo 1º (BRASIL, 1996), e a própria promoção de uma educação estética antirracista.",
            "Durante o processo de ensino e aprendizagem em Arte, é importante reconhecer a trajetória pessoal, artística e cultural dos estudantes na abordagem dos objetivos de aprendizagem, preservando os conhecimentos historicamente acumulados e alimentando o seu repertório e a sua autoestima de forma ética, estética, sensível, relativa, diversa, humana e enriquecedora, principalmente, no contínuo e recíproco processo avaliativo."
          ]
        },
        "Educação_Física": {
          "fundamentacao": [
            "Este componente curricular integra a área de Linguagens e suas Tecnologias desde a constituição dos Parâmetros Curriculares Nacionais (PCN). Educação Física, “enquanto componente da área de linguagens, significa promover atividades didáticas que auxiliem os estudantes a ler e produzir as manifestações culturais corporais, concebidas como texto e contextos” (NEIRA; SOUZA JÚNIOR, 2016, p. 9). Assim, concebe-se o corpo como um texto suscetível à comunicação, leitura e escritura, constituído de vários recursos de comunicação como vestimentas, ornamentos, marcas, cicatrizes e gestos.",
            "O conjunto de práticas corporais com aspectos lúdicos, como brincadeiras, danças, jogos, lutas, ginásticas, esportes e atividades de aventura, apresenta particularidades de formação da linguagem corporal e de valores e sentidos outorgados a elas. Nesse sentido, espera-se que os estudantes sejam “desafiados a refletir sobre essas práticas, aprofundando seus conhecimentos sobre as potencialidades e os limites do corpo, a importância de se assumir um estilo de vida ativo e os componentes do movimento relacionados à manutenção da saúde” (BRASIL, 2018a, p. 484). Uma das características do componente curricular Educação Física é inserir as práticas corporais entre as práticas sociais ou formas culturais, de maneira que sejam “sistematizadas, ressignificadas, hibridizadas e transmitidas de geração a geração em cada grupo cultural” (NUNES, 2016, p. 9).",
            "Existe uma relação a ser reforçada entre as práticas corporais e o compartilhamento da paisagem social relacionadas ao contexto histórico em que foram criadas, o que fortalece a interação entre os grupos sociais nas quais se originaram (NEIRA; SOUZA JÚNIOR, 2016). Nessa perspectiva, o componente curricular buscar prover ao estudante oportunidades de experienciar práticas corporais que podem fazer parte do seu projeto de vida, com protagonismo pessoal e social, pois “os gestos, mediante o intercâmbio que estabelecem com a cultura ao longo da vida, vão conformando um estilo de vida pessoal de ser, proporcionando um corpo que se identifica pela sua corporeidade” (NUNES, 2016, p. 9).",
            "Dessa maneira, é primordial que o indivíduo da educação conheça a sua história e os procedimentos que o relacionam às identidades que esta carrega, promovendo a identidade e a reflexão. Essa reflexão sobre as vivências contribui para a “formação de sujeitos que possam analisar e transformar suas práticas corporais, tomando e sustentando decisões éticas, conscientes e reflexivas em defesa dos direitos humanos e dos valores democráticos” (BRASIL, 2018a, p. 484).",
            "A fim de cumprir com os propósitos supracitados, os objetivos de aprendizagem relacionados à Educação Física buscam promover experiências pedagógicas que permitam aos estudantes reconhecerem o significado de cultura corporal por meio da sua prática contemporânea e histórica, do estudo e da pesquisa de textos científicos, jornalísticos, jurídicos e normativos, além da apreciação de manifestações artísticas. Pretende-se, assim, contribuir com seu projeto de vida e com sua participação na sociedade, identificando preconceitos, relações de poder, meios de exclusão, sexismo e conflitos ideológicos para, assim, adotar uma postura contrária, acrescendo suas possibilidades de ressignificação e mediação crítica, inclusiva, democrática e ética, pautada na cultura de paz e na prevalência dos direitos humanos."
          ]
        },
        "Língua_Inglesa": {
          "fundamentacao": [
            "Este componente curricular surge do entendimento de que os jovens estão cada vez mais conectados por meio de redes sociais e outras tecnologias de informação e comunicação. Nesse sentido, o conhecimento da Língua Inglesa se configura como instrumento de expansão dos horizontes de interação social e de acesso a culturas em escala global, já que o idioma é, atualmente, reconhecido mundialmente como um importante meio de transmissão de conhecimentos.",
            "Além disso, a globalização tem demandado níveis de interação entre os povos cada vez mais frequentes e profundos. Por meio dela, diversas áreas relacionadas à vida humana alcançaram e/ou consolidaram abrangência internacional; é o caso, por exemplo, do comércio, da ciência e do turismo. Essas relações têm sido, em grande medida, efetivadas por meio da Língua Inglesa, avultando sua importância planetária.",
            "Diante desse cenário, envolver os estudantes em situações de aprendizagem que lhes permitam desenvolver habilidades suficientes para utilizar a LI como recurso de acesso a conhecimentos e a oportunidades (de estudos, de trabalho, de lazer etc.) torna-se um imperativo para a educação brasileira, já que esses saberes podem ampliar as possibilidades dos jovens em suas escolhas de vida.",
            "Para tanto, este Currículo em Movimento preconiza a formação em LI centrada no desenvolvimento de estratégias pedagógicas que favoreçam ao jovem o contato com práticas diversificadas de linguagem e alicerçada na Pedagogia dos Multiletramentos, já consagrada no Sistema de Ensino do Distrito Federal. Importa esclarecer, ainda, que a perspectiva curricular acerca das experiências formativas relacionadas ao idioma devem abranger a interação com produções multissemióticas e multimidiáticas, sobretudo em contextos digitais, os quais, além do elevado potencial de circulação de informações que apresentam, são bastante difundidos entre o público jovem.",
            "Tendo em vista que o Currículo em Movimento da Educação Básica do Distrito Federal é um conjunto harmônico e orgânico de intencionalidades pedagógicas, o presente documento curricular foi elaborado de modo a permitir o aprofundamento das habilidades comunicacionais e sociointeracionais trabalhadas até os Anos Finais do Ensino Fundamental. Esse aprofundamento segue a mesma concepção do Currículo em Movimento do Ensino Fundamental, que tem como foco o sentido, e não a forma. Leva-se em consideração o contexto sociocultural dos estudantes, o que implica valorizar os seus interesses e suas necessidades, ampliar o panorama histórico do ensino de Língua Inglesa, outrora alicerçado em uma perspectiva estrutural/gramatical. Pretende-se que o estudante, ao final do Ensino Médio, seja capaz de utilizar o idioma, tanto na modalidade oral quanto na escrita, de forma autônoma, em interações relacionadas à cultura digital, ao desenvolvimento de sua identidade, ao mundo do trabalho, além dos contextos sociais e culturais já mencionados.",
            "Os objetivos de aprendizagem deste Currículo são pautados nas competências gerais e específicas da BNCC, que visam compreender as línguas como fenômeno geopolítico, histórico, cultural e social. Essa nova perspectiva demanda do professor de Língua Inglesa, além da formação continuada, abertura a uma trajetória que transforme a abordagem mais centrada no conteúdo e na estrutura gramatical em uma abordagem que possibilite o protagonismo do estudante, por focar-se no sentido, no contexto e na sua interação com o mundo e com o outro."
          ]
        },
        "Língua Portuguesa": {
          "fundamentacao": [
            "A estruturação curricular, em particular quanto ao ensino da Língua Portuguesa, implica determinar um conjunto de habilidades que consiste em objetivos de aprendizagem que procuram proporcionar aos estudantes uma formação voltada para as interações de conhecimento. Existe a necessidade de se construir relações de sentidos, seja pela aquisição dos mecanismos linguísticos, pela leitura e produção textual ou pelo enriquecimento cultural contido nas artes literárias e nos mais diversos gêneros textuais, como: verbetes enciclopédicos, dicionários, textos jurídicos, reportagens, notícias, podcasts, documentários.",
            "De acordo com a BNCC, o processo de ensino e aprendizagem em Língua Portuguesa necessita de práticas de linguagem, ou seja, leitura, produção de textos, oralidade e análise linguística/semiótica, cuja função é consolidar e complexificar as habilidades oriundas do Ensino Fundamental relativas à análise, síntese, compreensão dos efeitos de sentido e apreciação e réplica (BRASIL, 2018a). Dessa forma, a proposta curricular de Língua Portuguesa no Ensino Médio traz, além da divisão das seis unidades temáticas, o enfoque nas práticas de linguagens contidas em todas as unidades, propiciando uma formação integral quanto à educação linguística na contemporaneidade como aquela que possa trazer aos estudantes projetos de futuro em três dimensões: a diversidade produtiva, o pluralismo cívico e as identidades multifacetadas (ROJO, 2013).",
            "Dentro do aspecto linguístico, o ensino de língua “corresponde ao saber intuitivo que todo falante tem de sua própria língua, a qual tem sido chamada de “gramática internalizada'” (ANTUNES, 2007, p. 25). Não se pode, pois, realizar um encurtamento da língua, desencadeando um preconceito linguístico ainda tão enraizado na cultura brasileira (FARACO, 2008). A tarefa da escola encontra-se justamente na facilitação da incorporação do repertório linguístico aos estudantes, a partir de recursos e práticas comunicativas que lhes permitam empregar com segurança os estilos monitorados da língua, que exigem mais atenção e maior grau de planejamento (BORTONI-RICARDO, 2005).",
            "Dessa forma, o ensino das regras gramaticais deve ser voltado também ao uso, para que os falantes consigam elaborar as construções linguísticas nas diversas ocasiões em que tal uso é requerido, quer seja oral ou escrito. A gramática, nesses moldes, deixa de ser estática e passa a ser vista como funcional, significativa, discursiva e flexível, portanto passível de mudanças e reconhecimento de falares de quaisquer naturezas, as variações linguísticas.",
            "Cabe ao professor de Língua Portuguesa trabalhar não apenas os dita-\n\nmes gramaticais, mas facilitar a inserção dos estudantes na vivência cotidiana dos processos comunicativos, multiculturais e multissemióticos. Nesse sentido, o emprego dos recursos fonéticos, morfo-lexicais e morfossintáticos encontra-se nas mais diversas formas de interação comunicativa, seja em textos literários ou não literários, tendo como base os diferentes gêneros textuais presentes na atualidade (MARCUSCHI; DIONÍSIO, 2007).",
            "Em uma sociedade do conhecimento, em que há uma multiplicidade de informações disponíveis aos leitores, os textos multissemióticos podem ser representados imageticamente. A informação não está contida apenas no texto verbal, mas em todos os recursos visuais e sonoros que os auxiliam na leitura, na compreensão dos gêneros textuais, no planejamento e na posterior produção. Ademais, diante da profusão de plataformas informacionais contidas na internet, que vão para além da TV e do rádio, faz-se necessário um aprofundamento do conhecimento crítico acerca dos gêneros multimidiáticos, com o objetivo de explorar gêneros discursivos e dimensionar o ensino dentro de uma variedade de textos contemporâneos.",
            "Sob a perspectiva de uma sociedade heterogênea, os conflitos surgem devido ao fato de que tanto a escola quanto a sociedade procuram padronizar a cultura. Assim, a abordagem do multiculturalismo, contido nos objetivos de aprendizagem deste Currículo, procura dirimir as consequências negativas dessa padronização e promover as experiências exitosas da pluralidade cultural.",
            "O ato de ler e escrever está entrelaçado a distintas modalidades de linguagem além da escrita, como a imagem, a fala e a música. Os multiletramentos, assim, refletem sobre as mudanças sociais e tecnológicas verificadas na sociedade atual. A escola deve procurar diversificar os modos como as informações e os conhecimentos são disponibilizados, além de incentivar um planejamento para a leitura e produção dentro dessa perspectiva multiletrada, multissemiótica e multimodal (ROJO; MOURA, 2012). O desenvolvimento de linguagens híbridas envolve, dessa forma, desafios para os leitores e para os agentes que trabalham com a Língua.",
            "O conhecimento crítico e consciente da língua não é sinônimo de sucesso educacional. É necessária, também, uma abordagem das habilidades com foco na educação das emoções, ou seja, a promoção de um pensamento autônomo dos estudantes e suas potencialidades, no intuito de promover o desenvolvimento de competências cognitivas e socioemocionais. A aquisição do conhecimento linguístico, sem apontar aonde se quer chegar, não é suficiente para o estudante atual. Os estudantes possuem biografias distintas e, além de todas as informações que eles consomem diariamente, os rumos de suas vidas são cada vez mais variados. Pensar no futuro tornou-se tão importante quanto pensar no aprendizado diário para uma formação mais crítica e consciente do indivíduo (BRASIL, 20184).",
            "Espera-se, assim, que a comunidade escolar envolvida no processo de ensino e aprendizagem visualize a Língua Portuguesa como um meio para o ensino e o aperfeiçoamento no uso da língua em âmbitos variados: na vida cotidiana; no projeto de vida; no protagonismo; nos cenários cultural, social e ambiental; na arte e literatura; e em e para os Direitos Humanos."
          ],
          "Objetivos_de_Aprendizagem_por_Unidade_Tematica": [
            {
              "Unidade_Tematica": "LÍNGUA PORTUGUESA EM CONTEXTOS E PRÁTICAS CULTURAIS",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "LP01FG",
                  "descricao": "Aplicar os recursos de coesão (preposições, conjunções, pronomes, advérbios) a fim de proporcionar a produção crítica de relações lógico-discursivas em diferentes tipos de possibilidades textuais."
                },
                {
                  "codigo": "LP02FG",
                  "descricao": "Empregar os recursos expressivos de comunicação a fim de possibilitar a ampliação do conhecimento lexical (sinonímia, antonímia, paronímia, neologismo e hibridismo), em seu uso cotidiano, e a apropriação dos diversificados modos de formação vocabular existentes na língua materna."
                },
                {
                  "codigo": "LP03FG",
                  "descricao": "Selecionar os recursos fonéticos e fonológicos relacionados aos aspectos morfológicos e semânticos, consoante à posição do enunciador em relação à intencionalidade do texto, proporcionando maior criticidade nos mais variados contextos para a produção linguística e literária."
                }
              ]
            },
            {
              "Unidade_Tematica": "LÍNGUA PORTUGUESA EM CONTEXTOS E PRÁTICAS SOCIAIS",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "LP08FG",
                  "descricao": "Comparar diferentes projetos editoriais-institucionais, privados, públicos, financiados, independentes, ampliando o repertório de escolhas possíveis de fontes de informação e opinião, reconhecendo as posições críticas aos usos sociais que são feitos dos recursos linguísticos."
                },
                {
                  "codigo": "LP09FG",
                  "descricao": "Detectar, em textos multimidiáticos, estratégias argumentativas empregadas para o convencimento e a persuasão do público, tais como intimidação, sedução, comoção, chantagem, entre outras."
                }
              ]
            },
            {
              "Unidade_Tematica": "LÍNGUA PORTUGUESA EM E PARA CONTEXTOS DE DIREITOS HUMANOS",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "LP12FG",
                  "descricao": "Operar os aspectos metodológicos de análise e pesquisa linguística a partir do uso da análise linguística (período simples e composto, regência, concordância), desenvolvendo a concepção crítica do uso da língua de acordo com a adaptação que ela pode sofrer."
                }
              ]
            },
            {
              "Unidade_Tematica": "LÍNGUA PORTUGUESA EM CONTEXTOS SOCIOAMBIENTAIS",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "LP16FG",
                  "descricao": "Selecionar textos de diferentes gêneros, em plataformas informacionais da internet, sobre aspectos socioambientais que promovam um engajamento mais crítico do mundo."
                }
              ]
            },
            {
              "Unidade_Tematica": "LÍNGUA PORTUGUESA EM CONTEXTOS DE IDENTIDADE E PROTAGONISMO JUVENIL",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "LP19FG",
                  "descricao": "Analisar a relação do eu-social, pelo uso da leitura e do estudo da construção de gêneros textuais de predominância descritiva, informativa e narrativa, construindo, paulatinamente, o processo identitário."
                }
              ]
            },
            {
              "Unidade_Tematica": "LÍNGUA PORTUGUESA EM CONTEXTOS DE CULTURA DIGITAL",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "LP25FG",
                  "descricao": "Analisar, em textos de diferentes gêneros, recursos verbais e não-verbais utilizados com a finalidade de criar e mudar comportamentos e hábitos, para uma realidade mais ética nas relações interpessoais físicas e virtuais."
                }
              ]
            },
            {
              "Unidade_Tematica": "LÍNGUA PORTUGUESA EM CONTEXTOS E PRÁTICAS CULTURAIS",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "LP01FG",
                  "descricao": "Aplicar os recursos de coesão (preposições, conjunções, pronomes, advérbios) a fim de proporcionar a produção crítica de relações lógico-discursivas em diferentes tipos de possibilidades textuais."
                },
                {
                  "codigo": "LP02FG",
                  "descricao": "Empregar os recursos expressivos de comunicação a fim de possibilitar a ampliação do conhecimento lexical (sinonímia, antonímia, paronímia, neologismo e hibridismo), em seu uso cotidiano, e a apropriação dos diversificados modos de formação vocabular existentes na língua materna."
                },
                {
                  "codigo": "LP03FG",
                  "descricao": "Selecionar os recursos fonéticos e fonológicos relacionados aos aspectos morfológicos e semânticos, consoante à posição do enunciador em relação à intencionalidade do texto, proporcionando maior criticidade nos mais variados contextos para a produção linguística e literária."
                },
                {
                  "codigo": "LP04FG",
                  "descricao": "Relacionar informações sobre concepções artísticas e procedimentos de construção do texto literário (metrificação, rimas, ritmo, figuras de linguagem, prosódia musical), apreciando o modo como a literatura e as artes se constituem, dialogam e se retroalimentam, e ampliando o repertório sociocultural."
                },
                {
                  "codigo": "LP05FG",
                  "descricao": "Diferenciar o texto literário e não-literário a partir do uso das figuras de linguagem, bem como da sua plurissignificação e manifestação nos diversos contextos culturais, para a construção de uma perspectiva estética e ética sobre indivíduo, cultura e sociedade."
                },
                {
                  "codigo": "LP06FG",
                  "descricao": "Selecionar, a partir da visão geral dos estilos de época na literatura e músicas de língua portuguesa, elementos integrantes do contexto cultural de uma época como instrumentos de socialização da cultura e da recriação subjetiva da realidade de uma sociedade."
                },
                {
                  "codigo": "LP07FG",
                  "descricao": "Aplicar a língua portuguesa como língua materna, tendo em vista os diferentes tópicos gramaticais identitários da norma padrão (ortografia, acentuação, pontuação), mas sem retirar a perspectiva geradora de significação e integradora da organização do mundo e da própria identidade segundo a realidade da variação linguística, adaptando a língua a cada situação de uso sem manifestações do preconceito linguístico e da hipercorreção."
                }
              ]
            },
            {
              "Unidade_Tematica": "LÍNGUA PORTUGUESA EM CONTEXTOS E PRÁTICAS SOCIAIS",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "LP08FG",
                  "descricao": "Comparar diferentes projetos editoriais-institucionais, privados, públicos, financiados, independentes, ampliando o repertório de escolhas possíveis de fontes de informação e opinião, reconhecendo as posições críticas aos usos sociais que são feitos dos recursos linguísticos."
                },
                {
                  "codigo": "LP09FG",
                  "descricao": "Detectar, em textos multimidiáticos, estratégias argumentativas empregadas para o convencimento e a persuasão do público, tais como intimidação, sedução, comoção, chantagem, entre outras, e inferir quais são os objetivos de seu produtor e quem é seu público-alvo."
                },
                {
                  "codigo": "LP10FG",
                  "descricao": "Desenvolver estratégias de escolha lexical por meio de textos multimodais e multissemióticos referentes às práticas sociais, tendo como base as estruturas e os processos de formação das palavras da Língua Portuguesa."
                },
                {
                  "codigo": "LP11FG",
                  "descricao": "Observar, a partir da leitura e descrição de textos, as diferentes concepções de mundo, de ser humano e de conhecimento que constituem as diversas possibilidades de identidades sociais e individuais."
                }
              ]
            },
            {
              "Unidade_Tematica": "LÍNGUA PORTUGUESA EM E PARA CONTEXTOS DE DIREITOS HUMANOS",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "LP12FG",
                  "descricao": "Operar os aspectos metodológicos de análise e pesquisa linguística a partir do uso da análise linguística (período simples e composto, regência, concordância)."
                },
                {
                  "codigo": "LP13FG",
                  "descricao": "Distinguir as partes constituintes dos diversos gêneros textuais argumentativos e expositivos, proporcionando a elaboração da argumentação para o desenvolvimento crítico relacionada aos direitos individuais e coletivos."
                },
                {
                  "codigo": "LP14FG",
                  "descricao": "Explicar o processo de amadurecimento da arte brasileira como fundamento da identidade artística a partir do Romantismo e suas gerações."
                },
                {
                  "codigo": "LP15FG",
                  "descricao": "Relacionar o teatro romântico brasileiro com o processo histórico do Brasil e seu aprimoramento como nação independente."
                }
              ]
            },
            {
              "Unidade_Tematica": "LÍNGUA PORTUGUESA EM CONTEXTOS SOCIOAMBIENTAIS",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "LP16FG",
                  "descricao": "Selecionar textos de diferentes gêneros, em plataformas informacionais da internet, sobre aspectos socioambientais que promovam um engajamento mais crítico do mundo."
                },
                {
                  "codigo": "LP17FG",
                  "descricao": "Avaliar como obras significativas das literaturas brasiliense, brasileira e de outras nacionalidades dialogam com a questão socioambiental."
                },
                {
                  "codigo": "LP18FG",
                  "descricao": "Valorizar, a partir da leitura e descrição de textos diversos, os estilos das épocas literárias intrínsecas aos aspectos do Brasil como um país em ascensão."
                }
              ]
            },
            {
              "Unidade_Tematica": "LÍNGUA PORTUGUESA EM CONTEXTOS DE IDENTIDADE E PROTAGONISMO JUVENIL",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "LP19FG",
                  "descricao": "Analisar a relação do eu-social, pelo uso da leitura e do estudo da construção de gêneros textuais, construindo o processo identitário."
                },
                {
                  "codigo": "LP20FG",
                  "descricao": "Aplicar situações de estudo, procedimentos e estratégias de leitura e escrita, de modo consciente e ativo."
                },
                {
                  "codigo": "LP21FG",
                  "descricao": "Comparar sentidos construídos na leitura/escuta de textos literários de autoria própria ou de outros."
                },
                {
                  "codigo": "LP22FG",
                  "descricao": "Analisar e propor discussões sobre os sistemas de comunicação e informação, vivenciando diferentes papéis sociais."
                },
                {
                  "codigo": "LP23FG",
                  "descricao": "Analisar como ocorre a formação cultural e individual do ser humano e da sociedade."
                },
                {
                  "codigo": "LP24FG",
                  "descricao": "Analisar a construção da identidade crítica da classe artística brasileira de acordo com o Modernismo e o Pós-modernismo."
                }
              ]
            },
            {
              "Unidade_Tematica": "LÍNGUA PORTUGUESA EM CONTEXTOS DE CULTURA DIGITAL",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "LP25FG",
                  "descricao": "Analisar, em textos de diferentes gêneros, recursos verbais e não-verbais utilizados para criar e mudar comportamentos e hábitos."
                },
                {
                  "codigo": "LP26FG",
                  "descricao": "Examinar os aspectos de produção referentes à criação de textos multimodais, unindo linguagem verbal e não verbal."
                },
                {
                  "codigo": "LP27FG",
                  "descricao": "Analisar textos do campo jornalístico e midiático a partir do uso de novas tecnologias digitais de checagem de informação."
                },
                {
                  "codigo": "LP28FG",
                  "descricao": "Analisar a produção literária engajada e contemporânea em diferentes plataformas digitais."
                },
                {
                  "codigo": "LP29FG",
                  "descricao": "Discutir as relações entre o texto literário e o momento de sua produção, promovendo a produção oral e escrita do raciocínio crítico-avaliativo."
                },
                {
                  "codigo": "LP30FG",
                  "descricao": "Apreciar obras do repertório artístico-literário contemporâneo brasiliense e nacional, apropriando-se delas para intervenção no meio digital."
                }
              ]
            }
          ]
        }
      },
      "Matematica_e_suas_Tecnologias": {
        "Objetivos_Gerais": {
          "descricao": [
            "possibilitar o desenvolvimento do raciocínio lógico-matemático e argumentativo do estudante",
            "mostrar que o processo do descobrimento matemático é algo vivo e em desenvolvimento",
            "aplicar conceitos e procedimentos matemáticos a situações variadas",
            "mobilizar e articular conceitos, procedimentos e linguagens próprios da Matemática",
            "resolver e elaborar situações-problema em diversos contextos",
            "utilizar diferentes registros matemáticos de representação",
            "elaborar conjecturas a respeito de diferentes conceitos e propriedades matemáticas"
          ]
        },
        "Organizacao_Curricular": {
          "Principios": [
            "visão integrada da Matemática aplicada à realidade",
            "centralidade do estudante como sujeito de sua prática cognitiva",
            "articulação entre vivências, saberes e conhecimentos matemáticos",
            "uso da investigação, modelagem e resolução de problemas",
            "integração de tecnologias digitais ao currículo",
            "formação para a cidadania e para o aprendizado permanente"
          ],
          "Unidades_Tematicas": {
            "Numeros_e_Funcoes": {},
            "Geometria_Plana_e_Progressoes": {},
            "Funcoes": {},
            "Trigonometria_e_Geometria_Espacial": {},
            "Estatistica_e_Probabilidade": {},
            "Logica_Matematica_e_Inovacao_Tecnologica": {}
          }
        },
        "Objetivos_de_Aprendizagem_por_Unidade_Tematica": [
          {
            "Unidade_Tematica": "Números e Funções",
            "Objetivos_de_Aprendizagem": [
              {
                "codigo": "MAT01FG",
                "descricao": "Investigar os processos de cálculo de números reais, com foco nas taxas e nos índices de natureza socioeconômica (Índice de Desenvolvimento Humano, taxas de inflação, entre outros), para analisar criticamente a realidade e produzir argumentos."
              },
              {
                "codigo": "MAT02FG",
                "descricao": "Utilizar unidades de medida de diferentes grandezas e as conversões possíveis entre elas, adotadas ou não pelo Sistema Internacional (SI), para interpretar textos científicos ou divulgados pela mídia."
              },
              {
                "codigo": "MAT03FG",
                "descricao": "Reconhecer a definição de função presente em situações do cotidiano."
              },
              {
                "codigo": "MAT04FG",
                "descricao": "Identificar os conceitos de domínio, imagem, crescimento e decrescimento nas representações algébricas e gráficas."
              },
              {
                "codigo": "MAT05FG",
                "descricao": "Verificar modos de conversão entre as representações gráficas e algébricas."
              },
              {
                "codigo": "MAT06FG",
                "descricao": "Estruturar, gráfica e algebricamente, situações-problema de função polinomial do 1º grau, relacionando números expressos em tabelas e sua representação no plano cartesiano, para identificar padrões e criar conjecturas."
              },
              {
                "codigo": "MAT07FG",
                "descricao": "Delinear correspondência entre modelos algébricos e plano cartesiano ao elaborar gráficos de funções polinomiais de 1º grau."
              },
              {
                "codigo": "MAT08FG",
                "descricao": "Interpretar possíveis padrões e utilizar, quando necessário, o computador para interpolar pontos, com a finalidade de generalizar o problema por meio de uma reta."
              },
              {
                "codigo": "MAT09FG",
                "descricao": "Estruturar, gráfica e algebricamente, situações-problema de função polinomial do 2º grau, relacionando números expressos em tabelas e sua representação no plano cartesiano."
              },
              {
                "codigo": "MAT10FG",
                "descricao": "Delinear correspondência entre modelos algébricos e plano cartesiano ao elaborar gráficos de funções polinomiais de 2º grau."
              },
              {
                "codigo": "MAT11FG",
                "descricao": "Estruturar situações-problema por meio de funções polinomiais de 1º e 2º graus para construção de modelos e resolução de problemas."
              },
              {
                "codigo": "MAT12FG",
                "descricao": "Investigar pontos de máximo ou de mínimo de funções quadráticas em diferentes contextos."
              },
              {
                "codigo": "MAT13FG",
                "descricao": "Analisar gráficos de funções e taxas de variação para interpretação crítica de situações econômicas, demográficas, sociais e científicas."
              }
            ]
          },
          {
            "Unidade_Tematica": "Geometria Plana e Progressões",
            "Objetivos_de_Aprendizagem": [
              {
                "codigo": "MAT14FG",
                "descricao": "Resolver e elaborar situações-problema que envolvam medições e cálculos de perímetro, área, volume, capacidade e massa."
              },
              {
                "codigo": "MAT15FG",
                "descricao": "Calcular a área de uma superfície por meio de diferentes métodos, aplicando expressões de cálculo em situações reais."
              },
              {
                "codigo": "MAT16FG",
                "descricao": "Representar graficamente dados de área e perímetro de um polígono regular organizados em tabela."
              },
              {
                "codigo": "MAT17FG",
                "descricao": "Identificar polígonos que podem ser utilizados para ladrilhamento."
              },
              {
                "codigo": "MAT18FG",
                "descricao": "Resolver situações-problema sobre ladrilhamento do plano, conjecturando padrões."
              },
              {
                "codigo": "MAT19FG",
                "descricao": "Reconhecer padrões em progressões aritméticas (PA)."
              },
              {
                "codigo": "MAT20FG",
                "descricao": "Associar progressões aritméticas a funções afins de domínios discretos."
              },
              {
                "codigo": "MAT21FG",
                "descricao": "Reconhecer padrões em progressões geométricas (PG)."
              }
            ]
          },
          {
            "Unidade_Tematica": "Funções",
            "Objetivos_de_Aprendizagem": [
              {
                "codigo": "MAT22FG",
                "descricao": "Resolver e elaborar situações-problema que envolvam grandezas determinadas por razão ou produto."
              },
              {
                "codigo": "MAT23FG",
                "descricao": "Estruturar situações-problema com equações lineares simultâneas, utilizando tecnologias digitais."
              },
              {
                "codigo": "MAT24FG",
                "descricao": "Definir função exponencial e representá-la gráfica e algebricamente."
              },
              {
                "codigo": "MAT25FG",
                "descricao": "Resolver e elaborar situações-problema com funções exponenciais."
              },
              {
                "codigo": "MAT26FG",
                "descricao": "Associar progressões geométricas a funções exponenciais de domínios discretos."
              },
              {
                "codigo": "MAT27FG",
                "descricao": "Utilizar conceitos de matemática financeira para organizar e analisar o orçamento familiar."
              },
              {
                "codigo": "MAT28FG",
                "descricao": "Comparar situações-problema que envolvam juros simples e compostos."
              },
              {
                "codigo": "MAT29FG",
                "descricao": "Definir função logarítmica e representá-la gráfica e algebricamente."
              },
              {
                "codigo": "MAT30FG",
                "descricao": "Resolver e elaborar situações-problema com funções logarítmicas."
              },
              {
                "codigo": "MAT31FG",
                "descricao": "Identificar situações aplicáveis aos modelos exponencial e logarítmico."
              },
              {
                "codigo": "MAT32FG",
                "descricao": "Inferir a relação de inversão entre funções exponenciais e logarítmicas."
              },
              {
                "codigo": "MAT33FG",
                "descricao": "Reconhecer conceitos de domínio, imagem, crescimento e decrescimento em funções exponenciais e logarítmicas."
              }
            ]
          },
          {
            "Unidade_Tematica": "Trigonometria e Geometria Espacial",
            "Objetivos_de_Aprendizagem": [
              {
                "codigo": "MAT34FG",
                "descricao": "Definir o conceito de razões trigonométricas no triângulo retângulo."
              },
              {
                "codigo": "MAT35FG",
                "descricao": "Utilizar relações métricas, leis do seno e do cosseno em situações-problema."
              },
              {
                "codigo": "MAT36FG",
                "descricao": "Definir função trigonométrica e representá-la gráfica e algebricamente."
              },
              {
                "codigo": "MAT37FG",
                "descricao": "Reconhecer figuras planas presentes em sólidos geométricos."
              },
              {
                "codigo": "MAT38FG",
                "descricao": "Investigar processos de obtenção da medida do volume de sólidos geométricos."
              },
              {
                "codigo": "MAT39FG",
                "descricao": "Resolver situações-problema de cálculo de área e volume de sólidos."
              },
              {
                "codigo": "MAT40FG",
                "descricao": "Identificar sólidos geométricos relacionados a projeções cartográficas."
              },
              {
                "codigo": "MAT41FG",
                "descricao": "Investigar deformações de ângulos e áreas provocadas por projeções cartográficas."
              }
            ]
          },
          {
            "Unidade_Tematica": "Estatística e Probabilidade",
            "Objetivos_de_Aprendizagem": [
              {
                "codigo": "MAT42FG",
                "descricao": "Interpretar tabelas, gráficos e dados estatísticos divulgados pela mídia."
              },
              {
                "codigo": "MAT43FG",
                "descricao": "Avaliar a adequação de diagramas e gráficos para representar dados estatísticos."
              },
              {
                "codigo": "MAT44FG",
                "descricao": "Construir tabelas e gráficos de frequências com base em dados amostrais."
              },
              {
                "codigo": "MAT45FG",
                "descricao": "Executar pesquisa amostral e comunicar resultados estatísticos."
              },
              {
                "codigo": "MAT46FG",
                "descricao": "Resolver problemas envolvendo medidas de tendência central e dispersão."
              },
              {
                "codigo": "MAT47FG",
                "descricao": "Resolver situações-problema de contagem utilizando princípios multiplicativo e aditivo."
              },
              {
                "codigo": "MAT48FG",
                "descricao": "Identificar espaços amostrais em situações probabilísticas."
              },
              {
                "codigo": "MAT49FG",
                "descricao": "Classificar eventos equiprováveis ou não equiprováveis."
              },
              {
                "codigo": "MAT50FG",
                "descricao": "Calcular probabilidades considerando correspondências entre espaços amostrais."
              },
              {
                "codigo": "MAT51FG",
                "descricao": "Resolver situações-problema envolvendo probabilidade de eventos aleatórios."
              },
              {
                "codigo": "MAT52FG",
                "descricao": "Utilizar conhecimentos de probabilidade para tomada de decisões cotidianas."
              },
              {
                "codigo": "MAT53FG",
                "descricao": "Reconhecer eventos dependentes e independentes em experimentos aleatórios."
              },
              {
                "codigo": "MAT54FG",
                "descricao": "Aplicar o conceito de probabilidade condicional."
              },
              {
                "codigo": "MAT55FG",
                "descricao": "Resolver problemas de probabilidade em experimentos sucessivos."
              }
            ]
          },
          {
            "Unidade_Tematica": "Lógica Matemática e Inovação Tecnológica",
            "Objetivos_de_Aprendizagem": [
              {
                "codigo": "MAT56FG",
                "descricao": "Definir algarismos significativos e algarismos duvidosos, reconhecendo a existência de erro em toda medida."
              },
              {
                "codigo": "MAT57FG",
                "descricao": "Descrever algoritmos por meio de fluxogramas."
              },
              {
                "codigo": "MAT58FG",
                "descricao": "Utilizar pseudocódigo para estruturar algoritmos."
              },
              {
                "codigo": "MAT59FG",
                "descricao": "Estabelecer correspondência entre algoritmo e linguagem de programação."
              },
              {
                "codigo": "MAT60FG",
                "descricao": "Utilizar transformações isométricas e homotéticas para construir figuras e analisar produções humanas e naturais."
              }
            ]
          }
        ]
      },
      "Ciencias_da_Natureza_e_suas_Tecnologias": {
        "Desafios_do_Ensino_de_Ciencias_por_Area": "Garantir o reconhecimento de ideias e conceitos transversais em Ciências da Natureza, pelos estudantes de Ensino Médio, é um desafio que exige o entendimento de como se estrutura o pensamento da Biologia, da Fisica e da Química. Ainda que essas ciências compartilhem procedimentos e referenciais, suas bases epistemológicas são diversas e fundamentadas em modos de organização próprios. Isto é particularmente importante na medida em que a BNCC está organizada em competências e habilidades das áreas de conhecimento, e não por conteúdos disciplinares. As Ciências da Natureza reúnem, portanto, áreas de conhecimento que se propõem a explicar os fenômenos naturais a partir de diferentes bases epistemológicas, mas que convergem em muitos de seus processos metodológicos e recursos de observação, registro, análise e divulgação.",
        "Letramento_Cientifico_em_Ciencia_e_Tecnologia": "Entende-se o letramento científico como um processo contínuo, que se inicia anteriormente à vida escolar e se estende além dela, uma vez que a ciência está em permanente processo de revisão de conceitos a partir de novas informações e da incorporação de novos instrumentos de análise e coleta de dados. O consenso sobre a importância do letramento científico não significa que haja neutralidade no ensino de Ciências, que não está livre de valores, interesses, paixões e emoções. Assim, a não neutralidade da CT articula-se em duas dimensões indissociáveis: a gênese da demanda selecionada em um determinado contexto espaço-temporal e a formulação e solução de problemas enquadradas por paradigmas.",
        "As_Ciencias_da_Natureza_na_BNCC": "A área de conhecimento Ciências da Natureza e suas Tecnologias reúne três componentes curriculares: Biologia, Física e Química. Está presente na BNCC desde o 1º ano do Ensino Fundamental como Ciências e tem o objetivo de garantir aos estudantes o acesso à diversidade de conhecimentos científicos produzidos ao longo da história, bem como a aproximação gradativa aos principais processos, práticas e procedimentos da investigação científica. No Ensino Médio, tem por objetivo aprofundar e ampliar os conhecimentos desenvolvidos anteriormente, tratando a investigação como forma de engajamento dos estudantes na aprendizagem de processos, práticas e procedimentos científicos e tecnológicos.",
        "Competencias_Gerais_e_Especificas": [
          "A BNCC do Ensino Médio, na área de Ciências da Natureza e suas Tecnologias, está organizada a partir de três competências específicas e 26 habilidades.",
          "Analisar fenômenos naturais e processos tecnológicos, com base nas interações e relações entre matéria e energia, para propor ações individuais e coletivas que aperfeiçoem processos produtivos, minimizem impactos socioambientais e melhorem as condições de vida em âmbito local, regional e global.",
          "Analisar e utilizar interpretações sobre a dinâmica da Vida, da Terra e do Cosmos para elaborar argumentos, realizar previsões sobre o funcionamento e a evolução dos seres vivos e do Universo, e fundamentar e defender decisões éticas e responsáveis.",
          "Investigar situações-problema e avaliar aplicações do conhecimento científico e tecnológico e suas implicações no mundo, utilizando procedimentos e linguagens próprios das Ciências da Natureza, para propor soluções que considerem demandas locais, regionais e/ou globais, e comunicar suas descobertas e conclusões a públicos variados."
        ],
        "Objetivos_de_Aprendizagem_por_Unidade_Tematica": [
          {
            "Unidade_Tematica": "Matéria e Energia",
            "Objetivos_de_Aprendizagem": [
              {
                "codigo": "CNO1FG",
                "descricao": "Compreender o método científico como ferramenta do processo de construção e evolução do conhecimento humano, para aplicá-lo em situações cotidianas, científicas, socioeconômicas e tecnológicas que exijam o reconhecimento de padrões de regularidade."
              },
              {
                "codigo": "CNO2FG",
                "descricao": "Diferenciar processos de transformação e transferência de matéria e energia, incluindo as que ocorrem por meio do metabolismo celular, ao longo de cadeias alimentares e ciclos biogeoquímicos, com a utilização de expressões e representações de grandeza e temporalidade."
              },
              {
                "codigo": "CNO3FG",
                "descricao": "Diferenciar os conceitos de temperatura e calor interpretando as variações térmicas em diferentes contextos, moleculares, orgânicos, ambientais, físicos e tecnológicos, visando à aplicação da termodinâmica nas previsões de cenários e na construção de modelos e hipóteses"
              },
              {
                "codigo": "CN04FG",
                "descricao": "Entender de que maneira os principais elementos químicos que compõem os seres vivos (CHONPS) circulam na natureza e integram diferentes organismos por meio de processos metabólicos e fenômenos naturais, relacionando-os às estruturas químicas que permitiram o surgimento da vida e as transformações moleculares que caracterizam os processos metabólicos."
              },
              {
                "codigo": "CNO5FG",
                "descricao": "Distinguir os níveis de organização dos seres vivos, identificando características das moléculas orgânicas e inorgânicas, estruturas celulares, tecidos e sistemas que interagem de forma harmônica para a manutenção da vida de um organismo."
              },
              {
                "codigo": "CNO6FG",
                "descricao": "Reconhecer os diferentes tipos de radiação eletromagnética, suas fontes, discutindo os efeitos sobre os seres vivos e o meio ambiente das radiações eletromagnéticas e exemplificando suas aplicações na medicina, indústria, agricultura e na interpretação do registro geológico e arqueológico."
              },
              {
                "codigo": "CNOT7FG",
                "descricao": "Diferenciar entre sistemas abertos e fechados e suas implicações para a conservação de energia."
              },
              {
                "codigo": "CNOSFG",
                "descricao": "Analisar os biomas como fruto de interações entre fatores geográficos, climáticos e biológicos, com flora e fauna características e grande importância ambiental, social e biotecnológica."
              },
              {
                "codigo": "CNO9FG",
                "descricao": "Avaliar criticamente ações humanas que geram poluição, lixo e degradação, prevendo seus impactos, tanto na qualidade do ar quanto nos ecossistemas terrestres e aquáticos, e buscar alternativas sustentáveis para essas ações."
              },
              {
                "codigo": "CN10FG",
                "descricao": "Compreender a relação entre conservação ambiental e qualidade de vida das populações humanas, propondo e aplicando ações e políticas ambientais que considerem as características e o modo de vida das comunidades locais, como indígenas, quilombolas, ribeirinhas e do campo."
              },
              {
                "codigo": "CN11FG",
                "descricao": "Compreender o processo de construção da Tabela Periódica de acordo com a evolução dos modelos atômicos de Dalton a Rutherford-Bohr, de forma a reconhecer as variações das propriedades periódicas e aperiódicas conforme a localização dos elementos na Tabela."
              },
              {
                "codigo": "CN12FG",
                "descricao": "Reconhecer os diferentes tipos de ligações interatômicas (iônica, covalente e metálica) para compreender as propriedades físicas dos compostos moleculares, utilizando os conceitos referentes às suas interações."
              }
            ]
          },
          {
            "Unidade_Tematica": "Vida e Evolução",
            "Objetivos_de_Aprendizagem": [
              {
                "codigo": "CN13FG",
                "descricao": "Conhecer os sistemas e processos fisiológicos de manutenção do metabolismo e da homeostase no corpo humano, de forma a selecionar comportamentos e aplicar procedimentos de prevenção de distúrbios e manutenção da saúde corporal."
              },
              {
                "codigo": "CN14FG",
                "descricao": "Analisar a atividade dos diferentes sistemas do organismo humano, associando seu funcionamento regular ou irregular às interações entre suas partes e, também, do organismo com fatores do seu ambiente."
              },
              {
                "codigo": "CN15FG",
                "descricao": "Compreender de que maneira a homeostase do corpo humano pode ser auxiliada ou alterada por relações com outros grupos taxonômicos de seres vivos, como vírus, bactérias, arqueas, protozoários, algas, fungos, plantas e outros animais."
              },
              {
                "codigo": "CN16FG",
                "descricao": "Compreender que uma onda é uma oscilação que é função tanto do tempo como do espaço; que a luz do Sol é uma composição de frequências visíveis e não visíveis, reconhecendo que as cores que vemos dependem da frequência da luz incidente; e que os fenômenos ondulatórios estão intimamente relacionados com seu cotidiano."
              },
              {
                "codigo": "CN17FG",
                "descricao": "Compreender o desenvolvimento humano e as características comuns de cada fase da vida, reconhecendo que a interação do indivíduo com o ambiente físico e social é determinante para a promoção da sua saúde física e mental."
              },
              {
                "codigo": "CN18FG",
                "descricao": "Compreender conceitos, características e fenômenos relacionados à sexualidade, ao gênero, à reprodução, à embriologia, à gravidez e às infecções sexualmente transmissiveis."
              },
              {
                "codigo": "CN19FG",
                "descricao": "Compreender o conceito de \"substância psicoativa\", as classificações gerais dessas substâncias, seus efeitos no organismo humano, aplicações terapêuticas e as consequências do seu uso e abuso."
              },
              {
                "codigo": "CN20FG",
                "descricao": "Compreender os mecanismos celulares e fisiológicos de defesa do organismo contra toxinas, antígenos, patógenos e parasitas, de forma a avaliar situações de risco e adotar estratégias que busquem a manutenção da saúde do organismo."
              },
              {
                "codigo": "CN21FG",
                "descricao": "Compreender aspectos básicos de higiene, saneamento e saúde pública para avaliar situações e promover intervenções relacionadas ao sanitarismo e à prevenção de doenças."
              },
              {
                "codigo": "CN22FG",
                "descricao": "Propor ações de educação pela saúde física e mental, em especial para os jovens, em relação ao uso e abuso de substâncias psicoativas e práticas sexuais de risco."
              },
              {
                "codigo": "CN23FG",
                "descricao": "Calcular a solubilidade dos diferentes tipos de materiais, classificando-os por meio da sua composição e concentração/diluição (g/L, mol/L e porcentagem em massa e volume e suas conversões)."
              },
              {
                "codigo": "CN24FG",
                "descricao": "Discutir o impacto dos poluentes e as implicações sociais no tratamento dos residuos químicos."
              },
              {
                "codigo": "CN25FG",
                "descricao": "Compreender a atuação de medicamentos no organismo e os riscos da automedicação, inclusive de analgésicos e anti-inflamatórios vendidos sem receita, e a importância das recomendações do profissional de saúde e da bula para se evitar a superdosagem dessas drogas."
              },
              {
                "codigo": "CN26FG",
                "descricao": "Compreender que o ser humano e os demais seres vivos são frutos de uma complexa rede de interações ecológicas, interdependentes quanto a processos alimentares, cooperativos, competitivos e parasitários."
              },
              {
                "codigo": "CN27FG",
                "descricao": "Compreender a diversidade de vida na Terra, suas formas de manifestação, organização e a importância da interação entre os seres vivos em suas relações ecológicas, bem como seus usos como fonte de recursos, alimento, matéria-prima médica e biotecnológica, seus potenciais malefícios e a necessidade de manutenção do equilíbrio ambiental."
              },
              {
                "codigo": "CN28FG",
                "descricao": "Reconhecer os ácidos de Arrhenius (HCl, HNO,, HNO,, H CO,, H SO e H. SO), classificá-los quanto ao grau de ionização, ao número de hidrogênios ionizáveis e presença de oxigênio e nomeá-los de acordo com as regras da IUPAC."
              },
              {
                "codigo": "CN29FG",
                "descricao": "Reconhecer as bases de Arrhenius (metais alcalinos, alcalinos-terrosos, AI(OH), e NH,0H), classificá-las quanto ao grau de dissociação e ao número de hidroxilas e nomeá-las de acordo com as regras da IUPAC."
              },
              {
                "codigo": "CN30FG",
                "descricao": "Formular as reações de neutralização total e parcial entre ácidos e bases de Arrhenius, identificando como produtos a formação de sais (neutros, ácidos ou básicos) e água."
              },
              {
                "codigo": "CN31FG",
                "descricao": "Reconhecer os principais indicadores ácido-base (extrato de repolho roxo, papel de tornassol e fenolftaleina)."
              },
              {
                "codigo": "CN32FG",
                "descricao": "Utilizar a escala de pH para classificar as soluções ácidas, básicas e neutras."
              },
              {
                "codigo": "CN33FG",
                "descricao": "Reconhecer os óxidos inorgânicos (derivados do carbono, enxofre, nitrogênio, sódio e cálcio), classificando-os quanto a acidez ou alcalinidade, e nomeá-los de acordo com as regras da IUPAC."
              },
              {
                "codigo": "CN34FG",
                "descricao": "Relacionar os efeitos atmosféricos causados por compostos químicos (CO,, CH, SO, SO, NO, e CFC) com as interferências ambientais como o agravamento do efeito estufa, a chuva ácida e a depleção da camada de ozônio."
              }
            ]
          },
          {
            "Unidade_Tematica": "Terra e Universo",
            "Objetivos_de_Aprendizagem": [
              {
                "codigo": "CN35FG",
                "descricao": "Demonstrar domínio do método científico e ser capaz de realizar pesquisas em fontes diretas, técnicas ou de divulgação científica, aplicar métodos de controle experimental e elaborar texto de divulgação nos padrões técnico-científicos."
              },
              {
                "codigo": "CN36FG",
                "descricao": "Utilizar evidências científicas sobre as características fundamentais comuns dos seres vivos, seus níveis de organização e suas interações com o ambiente para respaldar argumentos em favor da origem, evolução e diversificação da vida."
              },
              {
                "codigo": "CN37FG",
                "descricao": "Avaliar os efeitos de fatores mutagênicos, como as radiações eletromagnéticas, no surgimento de novas características genéticas com impactos hereditários e evolutivos."
              },
              {
                "codigo": "CN38FG",
                "descricao": "Entender como ocorre a transmissão das características hereditárias ao longo das gerações e reconhecer argumentos que permitam um posicionamento crítico diante das aplicações atuais da genética molecular."
              },
              {
                "codigo": "CN39FG",
                "descricao": "Compreender que existem diferentes teorias para a origem e evolução da vida, além do fato de que a comunidade científica já refutou a abiogênese."
              },
              {
                "codigo": "CN40FG",
                "descricao": "Identificar as teorias de origem da vida, reconhecendo as características e necessidades fundamentais para o surgimento e a manutenção do metabolismo dos seres vivos."
              },
              {
                "codigo": "CN41FG",
                "descricao": "Conhecer as teorias evolutivas e o mecanismo de evolução das espécies, considerando que os seres vivos são passíveis de modificações e que sofrem alterações morfológicas e fisiológicas ao longo do tempo."
              },
              {
                "codigo": "CN42FG",
                "descricao": "Reconhecer que a comparação do DNA dos seres humanos demonstrou que todos pertencemos a uma mesma espécie, Homo sapiens, originária da África, com história evolutiva comum, resultado de processos evolutivos similares aos dos demais seres vivos."
              },
              {
                "codigo": "CN43FG",
                "descricao": "Compreender o potencial e a importância da biotecnologia para a melhoria das condições dos seres vivos e a importância da bioética na regulação e no controle das práticas científicas, de forma a avaliar intervenções na natureza e limitar usos abusivos de tecnologias ou propor práticas mais éticas e sustentáveis."
              },
              {
                "codigo": "CN44FG",
                "descricao": "Compreender o processo de obtenção dos combustíveis renováveis e não-renováveis, suas utilizações como fontes de energia e implicações dessas utilizações."
              },
              {
                "codigo": "CN45FG",
                "descricao": "Compreender a existência da relação entre o magnetismo e a eletricidade e que as forças entre partículas eletricamente carregadas dependem de seus movimentos relativos, reconhecendo que a energia elétrica de uso doméstico e industrial é produzida a partir do eletromagnetismo."
              },
              {
                "codigo": "CN46FG",
                "descricao": "Compreender as relações entre eletricidade e oxirredução, suas aplicações e seus impactos na qualidade de vida das pessoas."
              },
              {
                "codigo": "CN47FG",
                "descricao": "Reconhecer as propriedades do carbono para classificar as cadeias carbônicas (saturada ou insaturada, normal ou ramificada, heterogênea ou homogênea)."
              },
              {
                "codigo": "CN48FG",
                "descricao": "Diferenciar os hidrocarbonetos (alcanos, alcenos, alcinos, alcadienos e ciclanos) e designar a nomenclatura conforme as regras oficiais da IUPAC."
              },
              {
                "codigo": "CN49FG",
                "descricao": "Designar a nomenclatura oficial da IUPAC dos álcoois, das cetonas, dos ácidos carboxílicos, do éter e das aminas."
              },
              {
                "codigo": "CN50FG",
                "descricao": "Compreender a isomeria plana dos compostos orgânicos, classificando-a em função, cadeia, posição, compensação ou metameria."
              },
              {
                "codigo": "CN51FG",
                "descricao": "Reconhecer as principais reações orgânicas (hidrogenação, saponificação e esterificação), identificando os produtos importantes no cotidiano."
              },
              {
                "codigo": "CN52FG",
                "descricao": "Reconhecer que os polímeros de adição (Polietileno e PVC) e de condensação (Nylon e PET) são formados por repetições de monômeros."
              },
              {
                "codigo": "CN53FG",
                "descricao": "Discutir a importância socioeconômica e ambiental da reciclagem de materiais, em especial do uso dos plásticos em nosso dia a dia, propondo soluções relacionadas à química ambiental, ressaltando temas como poluição, reciclagem, armazenamento e incineração."
              }
            ]
          }
        ]
      },
      "Ciencias_Humanas_e_Sociais_Aplicadas": {
        "Integracao_Curricular": "Na educação básica, as Ciências Humanas e Sociais Aplicadas orientam-se pelo compromisso com a formação intelectual, ética e prática dos estudantes, tendo como eixo a compreensão integral dos seres humanos em suas relações consigo mesmos, com os outros e com o mundo. A integração curricular busca articular os conhecimentos da Filosofia, Geografia, História, Sociologia, Antropologia e Ciência Política, promovendo também o diálogo com outros campos do saber, como Comunicação, Economia, Direito, Psicologia e Tecnologia. Essa integração visa superar a compartimentação disciplinar, favorecendo uma abordagem interdisciplinar e transversal que possibilite a compreensão integrada da realidade social, histórica, cultural, política e ambiental, conforme os pressupostos da BNCC e do Currículo em Movimento do Distrito Federal.",
        "Complexidade_e_Dialogia": "A perspectiva da complexidade e da dialogia fundamenta-se no reconhecimento de que os fenômenos sociais são multidimensionais, históricos e atravessados por incertezas. As aprendizagens em Ciências Humanas e Sociais Aplicadas demandam a articulação de diferentes saberes, epistemologias e métodos, reconhecendo a coexistência de paradigmas concorrentes. A dialogia pedagógica promove o confronto de ideias, a problematização crítica e a construção coletiva do conhecimento, considerando que o ser humano é simultaneamente indivíduo, sociedade e espécie. Essa abordagem valoriza a interdisciplinaridade como atitude epistemológica e pedagógica, capaz de relacionar trabalho, ciência, cultura e tecnologia em um tecido complexo de relações.",
        "Progressao_das_Aprendizagens": "A progressão das aprendizagens no Ensino Médio busca aprofundar e consolidar os conhecimentos desenvolvidos no Ensino Fundamental, respeitando a continuidade e a complexificação dos processos cognitivos e afetivos. Fundamentada na Psicologia Histórico-Cultural, essa progressão considera a aprendizagem escolar como promotora do desenvolvimento, especialmente quando organizada a partir da zona de desenvolvimento proximal. Os objetivos de aprendizagem são estruturados por verbos que indicam processos cognitivos, objetos de conhecimento e contextos de aplicação, permitindo flexibilidade curricular e evitando a repetição mecânica de conteúdos. As unidades temáticas são independentes, porém articuladas, possibilitando que os estudantes avancem na compreensão crítica da realidade social e histórica.",
        "Curriculo_em_Acao": "O currículo em ação parte da prática social dos estudantes e da compreensão da realidade como totalidade dinâmica. A prática pedagógica envolve a mediação entre o conhecimento sistematizado e as experiências cotidianas, promovendo a passagem da compreensão sincrética à síntese crítica. Essa abordagem articula posturas pedagógico-críticas e pós-críticas, reconhecendo a incompletude dos saberes disciplinares e a necessidade de conectar redes de saberes diversas. O trabalho coletivo, a contextualização dos conteúdos e a intervenção consciente na realidade são centrais para a formação de sujeitos críticos, autônomos e comprometidos com a transformação social e com os Direitos Humanos.",
        "Objetivos_de_Aprendizagem_por_Unidade_Tematica": [
          {
            "Unidade_Tematica": "Ser Humano, Cultura e Conhecimento",
            "Objetivos_de_Aprendizagem": [
              {
                "codigo": "CHSAO1FG",
                "descricao": "Analisar diferentes contextos (filosóficos, geográficos, históricos, sociológicos) de construção dos discursos das Ciências Humanas e Sociais Aplicadas."
              },
              {
                "codigo": "CHSAO2FG",
                "descricao": "Distinguir as categorias imperativas para o desenvolvimento da linguagem mitológica e da linguagem racional."
              },
              {
                "codigo": "CHSAO3FG",
                "descricao": "Considerar a importância do pensamento crítico, a apreensão de conceitos, a argumentação e a problematização, observando sua organização, seu rigor e sua complexidade."
              },
              {
                "codigo": "CHSAO4FG",
                "descricao": "Identificar as diversas formas de registro de memória para a representação sociocultural, interpretando-as em sua historicidade e geograficidade."
              },
              {
                "codigo": "CHSAO5FG",
                "descricao": "Identificar os princípios epistemológicos de construção dos saberes em diferentes culturas, considerando as relações entre o senso comum e a consciência crítica em diferentes períodos históricos."
              },
              {
                "codigo": "CHSAO6FG",
                "descricao": "Articular epistemologias e modos discursivos das diversas áreas do conhecimento, a fim de refletir e produzir conceitos simples e complexos."
              },
              {
                "codigo": "CHSAO7FG",
                "descricao": "Compreender os acontecimentos da atualidade e relacioná-los a outros tempos históricos e a outras espacialidades socioculturais, posicionando-se criticamente a partir das interpretações existentes das relações entre eles."
              },
              {
                "codigo": "CHSAO8FG",
                "descricao": "Reconhecer-se como sujeito e autor da História (e suas historicidades), da cultura (e suas diversidades) e do pensamento (e suas diferentes visões de mundo), fortalecendo, assim, a edificação de suas identidades."
              },
              {
                "codigo": "CHSAO9FG",
                "descricao": "Compreender a importância dos estudos decoloniais no resgate e na (re)interpretação histórica, geográfica, sociológica e filosófica dos povos afetados pela lógica produtiva e simbólica colonial e neocolonial, na construção de seus saberes e identidades."
              },
              {
                "codigo": "CHSA10FG",
                "descricao": "Relacionar fenômenos cotidianos, históricos e geográficos a diferentes correntes de pensamento filosófico-político e perspectivas sociológicas."
              },
              {
                "codigo": "CHSA11FG",
                "descricao": "Criticar, de forma argumentativa e reflexiva, os limites e contradições de concepções reducionistas e/ou etnocêntricas sobre processos históricos, sociais, culturais, éticos e morais."
              },
              {
                "codigo": "CHSA12FG",
                "descricao": "Compreender os desdobramentos das práticas sociais, bem como seu papel e sua importância na produção, significação e ressignificação dos discursos e valores históricos, filosóficos, geográficos e sociológicos."
              },
              {
                "codigo": "CHSA13FG",
                "descricao": "Construir questões, soluções de problemas e intervenções conscientes e reflexivas referentes às relações cotidianas da vida pessoal, escolar, social, política, econômica e cultural."
              },
              {
                "codigo": "CHSA14FG",
                "descricao": "Elaborar hipóteses e argumentos a partir de conceitos, métodos, categorias e procedimentos de natureza científica sobre a influência das tecnologias digitais sobre os modos de pensar contemporâneos."
              },
              {
                "codigo": "CHSA15FG",
                "descricao": "Compreender a ocupação humana do espaço como processo de construção identitária dos territórios, das fronteiras físicas e simbólicas e das complexas relações da vida humana com a paisagem natural, em seus desdobramentos socioeconômicos, políticos e culturais ao longo da história."
              },
              {
                "codigo": "CHSA16FG",
                "descricao": "Diferenciar os processos de ocupação do espaço, no âmbito rural e urbano, e suas territorialidades, em contextos históricos e culturais, distintos em suas dimensões locais, regionais, nacionais e globais."
              },
              {
                "codigo": "CHSAI7FG",
                "descricao": "Analisar a relação de pertencimento e direito à terra em seus diferentes aspectos de uso, considerando a significação e a ressignificação atribuídas por indivíduos e coletividades em suas especificidades socioculturais."
              },
              {
                "codigo": "CHSA18FG",
                "descricao": "Analisar a cultura material e imaterial dos grupos humanos para a compreensão da construção de identidades em seu processo de formação e desenvolvimento histórico e geográfico."
              },
              {
                "codigo": "CHSA19FG",
                "descricao": "Compreender as dimensões socioeconômicas, étnicas, religiosas, simbólicas e de gênero, a fim de consolidar os conceitos de diversidade, identidade e diferença que constituem as identidades individuais e coletivas."
              },
              {
                "codigo": "CHSA20FG",
                "descricao": "Correlacionar o protagonismo social e as contribuições históricas, filosóficas, políticas, econômicas e culturais das populações indígenas e negras na formação da sociedade brasileira."
              },
              {
                "codigo": "CHSA21FG",
                "descricao": "Examinar os processos históricos e filosóficos que geraram relações socioeconômicas desiguais entre os grupos étnicos que constituíram e constituem a diversidade sociocultural do Brasil."
              },
              {
                "codigo": "CHSA22FG",
                "descricao": "Propor ações de combate às desigualdades étnico-raciais e de gênero, às formas de preconceito e discriminação por meio da compreensão crítica das relações epistêmicas e histórico-culturais constituídas."
              },
              {
                "codigo": "CHSA23FG",
                "descricao": "Reconhecer os diferentes papéis desempenhados pelos indivíduos e pelas coletividades na contemporaneidade, considerando as desigualdades presentes no processo produtivo e cultural."
              },
              {
                "codigo": "CHSA24FG",
                "descricao": "Comparar as diferentes visões de mundo, urbanas e rurais, em suas intersecções entre os aspectos simbólicos e concretos de construção das identidades socioculturais."
              },
              {
                "codigo": "CHSA25FG",
                "descricao": "Reconhecer os significados de território, fronteira e vazio espacial, bem como sua influência geopolítica em diferentes contextos e escalas, no âmbito geográfico, sociocultural e histórico."
              },
              {
                "codigo": "CHSA26FG",
                "descricao": "Analisar os elementos constituintes da relação entre sociedade e natureza, compreendendo a interdependência entre trabalho, cultura e meio ambiente."
              },
              {
                "codigo": "CHSA27FG",
                "descricao": "Discutir a genealogia das várias vertentes do conhecimento a partir das quais o sujeito constrói a realidade material e propõe outra imaterial."
              }
            ]
          },
          {
            "Unidade_Tematica": "Natureza, Trabalho e Tecnologia",
            "Objetivos_de_Aprendizagem": [
              {
                "codigo": "CHSA28FG",
                "descricao": "Compreender as características do modo de produção industrial, em suas diferentes manifestações político-ideológicas, considerando as crises inerentes aos processos de produção, circulação e consumo, bem como seus modos de reagir e aperfeiçoar-se."
              },
              {
                "codigo": "CHSA29FG",
                "descricao": "Relacionar as atuais correntes de pensamento histórico-filosóficas favoráveis e/ou contrárias ao modo de produção capitalista e os movimentos sociais influenciados por essas diferentes visões de mundo."
              },
              {
                "codigo": "CHSA30FG",
                "descricao": "Examinar a manutenção de desigualdades socioeconômicas, étnico-raciais, de gênero e sexualidade, seus diferentes contextos históricos, filosóficos e geográficos, considerando as relações de produção e consumo e seus impactos na estratificação e diferenciação social."
              },
              {
                "codigo": "CHSA31FG",
                "descricao": "Relacionar teorias filosóficas e científicas a temas e problemas tecnológicos, ético-políticos, econômicos, socioculturais, articulando-os aos planos pessoal, social e ambiental."
              },
              {
                "codigo": "CHSA32FG",
                "descricao": "Comparar os diferentes perfis socioeconômicos da população brasileira e mundial a partir de dados estatísticos, tabelas, mapas e outras formas de dados, fontes e informações."
              },
              {
                "codigo": "CHSA33FG",
                "descricao": "Analisar os impactos das transformações técnicas, tecnológicas, informacionais e científicas nas relações sociais e no mundo do trabalho, em contextos históricos distintos e em espaços rurais e urbanos, bem como na elaboração de novos valores socioculturais."
              },
              {
                "codigo": "CHSA34FG",
                "descricao": "Comparar o significado do trabalho e dos modelos de gestão em diferentes culturas e suas influências nos valores sociais e nas relações econômicas de produção, troca e consumo."
              },
              {
                "codigo": "CHSA35FG",
                "descricao": "Propor iniciativas de redistribuição da renda e práticas colaborativas, dialogando com as formas contemporâneas de desenvolvimento da sociedade industrial, como por exemplo, suas vertentes financeira, estética e ambiental."
              },
              {
                "codigo": "CHSA36FG",
                "descricao": "Comparar indicadores sociais e econômicos em diferentes tempos e espaços, fazendo uso de recursos estatísticos e quantitativos para a análise de dados."
              },
              {
                "codigo": "CHSA37FG",
                "descricao": "Elucidar o papel da indústria cultural e de massas no estímulo ao consumismo e seus impactos econômicos e socioambientais, para compreender a sociedade contemporânea."
              },
              {
                "codigo": "CHSA38FG",
                "descricao": "Propor ações que promovam sustentabilidade, saúde coletiva, segurança alimentar, cidadania ambiental e protagonismo social na transformação de valores e práticas em relação ao meio ambiente."
              },
              {
                "codigo": "CHSA39FG",
                "descricao": "Refletir criticamente acerca dos impactos socioambientais do atual modelo de produção e consumo, relacionando-os por meio de argumentos ao agravamento dos desastres naturais, climáticos e ambientais."
              },
              {
                "codigo": "CHSA40FG",
                "descricao": "Analisar os impactos econômicos e socioambientais de práticas produtivas ligadas à exploração dos recursos naturais e às atividades agroindustriais, em contextos geográficos e históricos distintos."
              },
              {
                "codigo": "CHSA41FG",
                "descricao": "Comparar modelos produtivos e usos de recursos naturais, em escala local, regional, nacional e global, observando as especificidades culturais e suas relações com os modos de produção e consumo."
              },
              {
                "codigo": "CHSA42FG",
                "descricao": "Reconhecer as contribuições tecnológicas e os conhecimentos das comunidades indígenas, quilombolas e demais povos tradicionais sobre processos de proteção à biodiversidade e práticas produtivas bioéticas e sustentáveis."
              },
              {
                "codigo": "CHSA43FG",
                "descricao": "Debater as questões socioambientais por meio de práticas que favoreçam o desenvolvimento sustentável nas escalas local, regional, global e transnacional."
              },
              {
                "codigo": "CHSA44FG",
                "descricao": "Analisar as atuações dos organismos internacionais e nacionais ligados ao meio ambiente, reconhecendo as práticas sustentáveis por instituições e instrumentos de regulação nacionais e internacionais."
              },
              {
                "codigo": "CHSA45FG",
                "descricao": "Relacionar a questão socioambiental com as diversas disputas geopolíticas e geoestratégicas nas escalas local, regional e global."
              },
              {
                "codigo": "CHSA46FG",
                "descricao": "Propor soluções de formas de trabalho e de transformação da natureza, considerando os impactos causados pelas técnicas e pelos usos dos recursos naturais ao longo do tempo."
              },
              {
                "codigo": "CHSA4TFG",
                "descricao": "Utilizar os recursos informacionais, conceituais e técnicos da linguagem cartográfica para a compreensão de fenômenos naturais e sociais, em suas diferentes escalas de ocorrência e em diversos contextos históricos."
              },
              {
                "codigo": "CHSA48FG",
                "descricao": "Compreender as situações e os contextos socioculturais nos quais estão inseridas as ciências e as tecnologias, para utilizá-las de forma consciente e crítica."
              },
              {
                "codigo": "CHSA49FG",
                "descricao": "Compreender a dinâmica atual de produção de informações, propondo o debate acerca das implicações e das consequências da proliferação de notícias falsas e da espetacularização de acontecimentos pela mídia e pela política."
              },
              {
                "codigo": "CHSAS50FG",
                "descricao": "Entender as formas de linguagens, por meio das tecnologias de interação social e seus desdobramentos nas formas de pensamento e sociabilidade, na construção do indivíduo e da sociedade contemporâneos."
              },
              {
                "codigo": "CHSA51FG",
                "descricao": "Explicar os elementos que interferem no processo social, esclarecendo as concepções ético-políticas em sua relação com a escola, o trabalho e a cultura."
              },
              {
                "codigo": "CHSA52FG",
                "descricao": "Debater as questões técnico-científicas, éticas e políticas contemporâneas que compõem a agenda pública em nível local, nacional e global."
              }
            ]
          },
          {
            "Unidade_Tematica": "Direitos Humanos, Política e Cidadania",
            "Objetivos_de_Aprendizagem": [
              {
                "codigo": "CHSA53FG",
                "descricao": "Reconhecer as formas de organização das relações de poder e resistência, em escala micro e macro, nas diferentes sociedades ao longo da história."
              },
              {
                "codigo": "CHSA54FG",
                "descricao": "Compreender os processos histórico-culturais de construção de categorias relativas a países, territórios, povos e nações."
              },
              {
                "codigo": "CHSA55FG",
                "descricao": "Identificar as dimensões filosófica, política e social do exercício da cidadania e as diferentes formas de participação da sociedade civil na construção e na manutenção das sociedades democráticas."
              },
              {
                "codigo": "CHSA56FG",
                "descricao": "Debater o papel dos organismos, blocos e acordos internacionais nas relações geopolíticas e financeiras mundiais e suas implicações territoriais, sociais, históricas e culturais para as populações locais e para os diferentes países."
              },
              {
                "codigo": "CHSASTFG",
                "descricao": "Examinar o papel geopolítico dos diferentes agentes sociais nos conflitos étnicos e territoriais, nacionais e internacionais, no contexto global contemporâneo."
              },
              {
                "codigo": "CHSAS58FG",
                "descricao": "Identificar as concepções éticas e morais produzidas pelos seres humanos em diferentes contextos geográficos, histórico-filosóficos, socioeconômicos e políticos."
              },
              {
                "codigo": "CHSAS59FG",
                "descricao": "Explicar as maneiras como valores e atitudes promovem a constituição e a compreensão de sujeitos solidários, responsáveis e comprometidos com diferentes saberes em suas historicidades, geograficidades e diversidades filosófica e sociológica."
              },
              {
                "codigo": "CHSA6O0FG",
                "descricao": "Avaliar o impacto efetivo das transformações socioculturais e tecnológicas no debate público e nos valores, nas atitudes e na tomada de decisões dos sujeitos."
              },
              {
                "codigo": "CHSA61FG",
                "descricao": "Criticar a naturalização de diferentes formas de violência nas sociedades contemporâneas e os casos cotidianos de intolerância, propagação de ódio, construção de estereótipos e discriminação."
              },
              {
                "codigo": "CHSA62FG",
                "descricao": "Desenvolver valores, atitudes e práticas socioculturais que promovam a reparação das violações dos Direitos Humanos."
              },
              {
                "codigo": "CHSA63FG",
                "descricao": "Avaliar mecanismos de combate às diversas formas de violência e seus aspectos sociais, significados e usos políticos, influência cultural, bem como suas implicações psicológicas e afetivas."
              },
              {
                "codigo": "CHSA64FG",
                "descricao": "Discutir os princípios da Declaração Universal dos Direitos Humanos e suas relações com os contextos local, nacional e internacional."
              },
              {
                "codigo": "CHSA65FG",
                "descricao": "Compreender os Direitos Humanos a partir das lutas cotidianas pela dignidade humana, inscritas nas práticas sociais, históricas e geográficas de indivíduos e coletividades."
              },
              {
                "codigo": "CHSA66FG",
                "descricao": "Relacionar os processos de construção histórico-filosóficos do conceito de cidadania e sua importância para os Direitos Humanos e para os direitos civis, políticos e socioambientais."
              },
              {
                "codigo": "CHSA67FG",
                "descricao": "Compreender as conquistas democráticas a partir dos conflitos sociais e das lutas populares, em contextos históricos e geográficos distintos, bem como as possibilidades de uma atuação social consciente e protagonista."
              },
              {
                "codigo": "CHSA68FG",
                "descricao": "Examinar a importância dos direitos civis, sociais e políticos consagrados na Constituição da República Federativa do Brasil de 1988, a Constituição Cidadã, relacionando-os aos movimentos pela redemocratização."
              },
              {
                "codigo": "CHSA69FG",
                "descricao": "Relacionar os princípios da Declaração Universal dos Direitos Humanos às situações cotidianas de violações dos Direitos Humanos e aos conflitos armados, genocídios, escravidão, entre outros."
              },
              {
                "codigo": "CHSATOFG",
                "descricao": "Propor diálogos interculturais como possibilidade de construir relações democráticas e, também, como elemento integrador em meio à diversidade dos seres humanos."
              },
              {
                "codigo": "CHSAT71FG",
                "descricao": "Resgatar memórias que elucidem e promovam a superação de acontecimentos socioculturais traumáticos (as colonizações, a escravidão, a segregação étnico-racial, os regimes políticos de exceção), a fim de possibilitar medidas de reconciliação e reparação."
              },
              {
                "codigo": "CHSA72FG",
                "descricao": "Identificar as várias vertentes do conhecimento, considerando seus desdobramentos na ética, na política, na vida do homem em sociedade e na relação com a natureza."
              },
              {
                "codigo": "CHSAT73FG",
                "descricao": "Refletir criticamente sobre a própria experiência cotidiana nos diversos grupos e organizações da sociedade, buscando o entendimento, o diálogo e a proposição de juízos de valores, bem como a condução de posturas proativas e resolutivas dentro e fora da escola."
              },
              {
                "codigo": "CHSAT74FG",
                "descricao": "Problematizar, de modo organizado, sistemático e rigoroso, informações e opiniões propostas relativas à vida, à natureza e à sociedade."
              },
              {
                "codigo": "CHSAT75FG",
                "descricao": "Identificar ações individuais e coletivas que promovam uma sociedade com justiça social e respeito à diversidade, à identidade e à diferença."
              }
            ]
          }
        ],
        "Itinerarios_Formativos": {
          "Estrutura_da_Carga_Horaria": {
            "Partes": [
              "Projeto de Vida",
              "Língua Espanhola",
              "Eletivas Orientadas",
              "Trilhas de Aprendizagens"
            ]
          },
          "Componentes_Gerais": {
            "Objetivos_e_Principios": {
              "descricao_geral": "Os Itinerários Formativos devem possibilitar o aprofundamento e a ampliação das aprendizagens relacionadas às competências gerais da BNCC, além de incorporar, nas estratégias educacionais, valores relacionados à ética, liberdade, democracia, justiça social, pluralidade, solidariedade e sustentabilidade.",
              "principios_orientadores": [
                "fortalecimento do interesse, engajamento e protagonismo dos estudantes",
                "garantia da permanência e aprendizagem na escola",
                "diversificação da oferta e múltiplas trajetórias formativas",
                "articulação dos saberes com o contexto histórico, econômico, social, científico, ambiental, cultural, local e do mundo do trabalho",
                "flexibilização curricular"
              ]
            },
            "Eixos_Estruturantes": {
              "lista": [
                {
                  "nome": "Investigação Científica",
                  "descricao": "Possibilitar o desenvolvimento da capacidade investigativa e da sistematização do conhecimento, por meio de práticas e produções científicas que permitam o aprofundamento dos conceitos fundantes da ciência, a interpretação e compreensão de fenômenos, assim como a proposição de intervenções que considerem as características locais."
                },
                {
                  "nome": "Processos Criativos",
                  "descricao": "Desenvolver e expandir a capacidade dos estudantes em propor e realizar projetos inovadores, de forma criativa, e possibilitar o aprofundamento dos conhecimentos sobre as artes, a cultura, as diferentes mídias e as ciências."
                },
                {
                  "nome": "Mediação e Intervenção Sociocultural",
                  "descricao": "Ampliar a capacidade de os estudantes utilizarem seus conhecimentos adquiridos para atuarem como agentes de mudanças e possibilitar a realização de projetos que contribuam para a construção de uma sociedade mais ética, justa, democrática, inclusiva, solidária e sustentável."
                },
                {
                  "nome": "Empreendedorismo",
                  "descricao": "Ampliar a capacidade dos estudantes para unir conhecimentos de diferentes áreas com o fim de empreender projetos e se adaptar aos diferentes contextos do mundo do trabalho, estimulando as habilidades relacionadas ao autoconhecimento e ao protagonismo."
                }
              ]
            },
            "Formas_de_Oferta_dos_Itinerarios": {
              "descricao": "Devem promover estratégias pedagógicas diversificadas, dentre elas, projetos, oficinas, núcleos de estudo, unidades de acompanhamento, entre outras situações de trabalho que os estudantes poderão escolher, de forma orientada.",
              "caracteristicas": [
                "flexibilização curricular",
                "aprofundamento e ampliação das aprendizagens",
                "uso de metodologias que favoreçam o protagonismo juvenil",
                "avaliações formativas",
                "ritmos diferenciados de aprendizagem"
              ]
            },
            "Parcerias_para_Oferta": {
              "descricao": "A oferta dos Itinerários Formativos no Novo Ensino Médio possibilita a articulação com instituições parceiras para o oferecimento de outros conhecimentos que são exigidos para a formação cidadã dos estudantes.",
              "condicoes": [
                "parcerias podem ocorrer em parte ou no todo dos itinerários",
                "podem envolver cursos de qualificação profissional e técnicos de nível médio",
                "oferta presencial ou na modalidade de Educação a Distância",
                "emissão de documentos comprobatórios pelas instituições parceiras"
              ]
            },
            "Estrutura_de_Oferta": {
              "descricao": "Um dos princípios que norteiam os Itinerários Formativos é a flexibilização, segundo a qual a composição das unidades curriculares nessa parte do currículo será personalizada e orientada.",
              "componentes": [
                "Projeto de Vida",
                "Língua Espanhola",
                "Eletivas Orientadas",
                "Trilhas de Aprendizagens"
              ]
            },
            "Projeto_de_Vida": {
              "objetivo": "Propiciar um momento de autorreflexão sobre seu presente e futuro, estimulando a autonomia, o protagonismo e o desenvolvimento das competências sociais para que os estudantes se tornem cidadãos ativos e responsáveis.",
              "finalidades": [
                "planejar trajetórias ao longo do Ensino Médio",
                "refletir sobre escolhas de eletivas orientadas e trilhas de aprendizagem",
                "tomar decisões refletidas",
                "engajar-se no trabalho coletivo",
                "compreender as responsabilidades de cada escolha"
              ],
              "vertentes": [
                {
                  "nome": "Transição para o Ensino Médio",
                  "descricao": "Trabalhar a dificuldade de transição entre o Ensino Fundamental e o Ensino Médio, bem como a necessidade de planejamento e organização dos estudantes."
                },
                {
                  "nome": "Desenvolvimento do Projeto de Vida",
                  "descricao": "Estimular o autoconhecimento e a reflexão sobre o percurso para a vida adulta, sem definir precocemente profissão ou área de formação."
                },
                {
                  "nome": "Desenvolvimento do Plano Individual de Curso",
                  "descricao": "Elaborar um planejamento da trajetória no Ensino Médio, em conjunto com o professor orientador, de acordo com as potencialidades do estudante."
                },
                {
                  "nome": "Orientação para Prosseguimento dos Estudos",
                  "descricao": "Orientar estratégias para o acesso ao Ensino Superior, Educação Profissional e Tecnológica, concursos públicos, empreendedorismo e outras formas de ingresso no mundo do trabalho."
                }
              ],
              "caracter_obrigatorio": "A unidade curricular Projeto de Vida será ofertada a todos os estudantes ao longo de todo o Ensino Médio, como unidade curricular obrigatória."
            }
          }
        },
        "Lingua_Espanhola": {
          "Objetivos_Gerais": "A ampliação crítica das relações sociais por meio dos estudos das diferentes linguagens humanas nas plataformas digitais existentes.",
          "Objetivos_de_Aprendizagem_por_Unidade_Tematica": [
            {
              "Unidade_Tematica": "LÍNGUA ESPANHOLA EM CONTEXTOS SOCIOAMBIENTAIS",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "ESP43",
                  "descricao": "Averiguar o funcionamento de órgãos públicos normatizadores e fiscalizadores de questões ambientais, a partir da análise linguística de textos oficiais relacionados à área, para a produção e divulgação de materiais informativos e opinativos referentes a temáticas socioambientais."
                },
                {
                  "codigo": "ESP44",
                  "descricao": "Analisar as políticas públicas de combate às ocupações ilegais/desordenadas e às queimadas, bem como a aplicabilidade da legislação vigente voltada ao uso consciente dos recursos hídricos, para um monitoramento ativo e responsável do Patrimônio Ambiental do DF e da Região Integrada de Desenvolvimento do Distrito Federal e Entorno (RIDE)."
                },
                {
                  "codigo": "ESP45",
                  "descricao": "Posicionar-se, pelo uso de debates, acerca de questões socioambientais, indígenas, quilombolas e dos povos ciganos, presentes em textos midiáticos de âmbito nacional e distrital, favorecendo o raciocínio crítico, prospectivo e interpretativo."
                },
                {
                  "codigo": "ESP46",
                  "descricao": "Verificar ações artísticas, desportivas, verbais e socioculturais que envolvem a preservação do meio ambiente e o incentivo à sustentabilidade; visando reconstruí-las em contextos pedagógicos, escolares e socioculturais e, também, digitais."
                },
                {
                  "codigo": "ESP47",
                  "descricao": "Distinguir diferentes estilos e espaços cênicos, esportivos e de letramento para analisar a dinâmica de práticas sociais, tradicionais e contemporâneas, que envolvem o meio ambiente e contextualizam campos específicos dos diferentes componentes da Área de Linguagens e suas Tecnologias."
                },
                {
                  "codigo": "ESP48",
                  "descricao": "Comparar a espacialidade visual com práticas artísticas, esportivas, históricas e socioculturais (Arte Medieval - bizantina, românica e gótica, Renascentista - clássica e neoclássica, barroco, movimentos artísticos e literários - romantismo, realismo, naturalismo) para apreciar a construção de estéticas e monumentos que se inspiram e interferem em paisagens e no meio ambiente."
                },
                {
                  "codigo": "ESP49",
                  "descricao": "Analisar a participação cidadã, democrática, humana, sensível, diversa, por meio do posicionamento crítico das teorias, práticas e relações estéticas da Arte, da Educação Física e das Línguas Portuguesa e Estrangeiras com as novas tecnologias, o meio ambiente e a biodiversidade."
                },
                {
                  "codigo": "ESP50",
                  "descricao": "Vivenciar práticas corporais praticadas em espaços naturais e espaços urbanos de forma crítica, que leve em conta o meio ambiente, a arquitetura local, o patrimônio público e a consciência socioambiental para possibilidades de atuação social e política, objetivando a manutenção e a criação de iniciativas públicas de esporte e lazer em sua comunidade, em consonância com a preservação do meio ambiente."
                },
                {
                  "codigo": "ESP51",
                  "descricao": "Contrastar as ações que envolvem o Brasil e os países que falam a Língua Espanhola, no tocante a acordos internacionais acerca do meio ambiente, com o objetivo de desenvolver a consciência e o protagonismo ambiental quanto à preservação em níveis local, regional e global."
                },
                {
                  "codigo": "ESP52",
                  "descricao": "Categorizar, na Língua Espanhola, ações individuais e coletivas que possibilitem a reflexão sobre a importância do trabalho voluntário, para a melhoria da relação do individuo com o meio ambiente e com a comunidade em que vive, fortalecendo a consciência de pertencimento local, regional e global."
                },
                {
                  "codigo": "ESP53",
                  "descricao": "Criar, utilizando a Língua Espanhola, orientações/sugestões para o desenvolvimento da sustentabilidade em âmbitos local, regional e global, visando a conscientização e a preservação do patrimônio ambiental."
                }
              ]
            },
            {
              "Unidade_Tematica": "LÍNGUA ESPANHOLA EM CONTEXTOS DE IDENTIDADE E PROTAGONISMO JUVENIL",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "ESP54",
                  "descricao": "Criar, pelo uso do LinkedIn, Infográficos, Currículo Digital, Blog Profissional, registros digitais profissionais em diferentes linguagens, no propósito de validar os projetos de vida alicerçados nas trajetórias de cada indivíduo."
                },
                {
                  "codigo": "ESP55",
                  "descricao": "Posicionar-se a partir de debates e discussões sobre temas de interesse da juventude, apropriando-se de bases legais, como o Estatuto da Juventude e as políticas públicas vigentes, para tornarem-se protagonistas de ações que contemplem a condição juvenil."
                },
                {
                  "codigo": "ESP56",
                  "descricao": "Avaliar os valores culturais e humanos no patrimônio artístico, arquitetônico e literário, valorizando as peculiaridades estruturais e estilísticas de diferentes gêneros artísticos e literários, a fim de fortalecer a elaboração da subjetividade e das inter-relações pessoais."
                },
                {
                  "codigo": "ESP57",
                  "descricao": "Planejar, de forma colaborativa, a produção de projetos culturais e de entretenimento para a divulgação, produção de comentários e avaliação de produções culturais e artísticas de interesse juvenil."
                },
                {
                  "codigo": "ESP58",
                  "descricao": "Desenvolver as etapas de produção da pesquisa científica a partir dos gêneros textuais envolvidos na sua realização e divulgação, reconhecendo as múltiplas formas como esse conhecimento é produzido e difundido nas sociedades contemporâneas."
                },
                {
                  "codigo": "ESP59",
                  "descricao": "Selecionar procedimentos de checagem de fatos noticiados e demais informações veiculadas nos sistemas de comunicação e informação e que originam o fenômeno da pós- -verdade, detectando a veracidade e os interesses implícitos dessas informações."
                },
                {
                  "codigo": "ESP60",
                  "descricao": "Descobrir coletivos indígenas, negros, latino-americanos e outros grupos étnicos que fazem uso de diversas expressões artísticas, verbais e desportivas (hip hop, rock, danças urbanas) para discutir a expressão e manifestação de suas ideias, de forma mútua e intercultural, por meio das diferentes linguagens e suas tecnologias."
                },
                {
                  "codigo": "ESP61",
                  "descricao": "Distinguir as danças e expressões brasileiras das matrizes culturais dos povos indigenas (cateretê, caiapós, cururu, guajajara, jacundá, boi-bumbá), africanas e afro-brasileiras (capoeira, congada, jongo, maracatu, samba de roda), valorizando e praticando seus saberes e fazeres culturais de formação da identidade artística, linguística e esportiva nacional."
                },
                {
                  "codigo": "ESP62",
                  "descricao": "Identificar conceitos sobre o corpo e discursos linguísticos e identitários presentes na expressividade corporal (ações corporais - movimento, espaço, tempo, peso, fluência, conceito de corpo dual, totalidade, corporeidade) para experimentar seus procedimentos de improvisação e criação relacionados aos diferentes modos próprios e sensíveis de criar, recriar e expressar o movimento estético e corporal em contextos pedagógicos, artísticos e desportivos."
                },
                {
                  "codigo": "ESP63",
                  "descricao": "Utilizar processos criativos incorporados à corporeidade e suas expressões verbais e estéticas, de modo a desenvolver o repertório artístico e cultural; contribuindo para a autonomia e trajetória de vida por meio do autoconhecimento corpóreo em práticas artiísticas, desportivas e expressivas."
                },
                {
                  "codigo": "ESP64",
                  "descricao": "Apreciar espetáculos e manifestações artísticas, verbais e desportivas que envolvem as diferentes linguagens, no entorno escolar e além dele, para aprimorar a fruição, a crítica e a leitura de estéticas tradicionais e contemporâneas como parte do processo de formação do público/espectador."
                },
                {
                  "codigo": "ESP65",
                  "descricao": "Interpretar os conceitos de atividade física, aptidão física (principalmente os componentes da aptidão física relacionados à saúde), saúde e qualidade de vida (e seus fatores), bem como seus benefícios e comorbidades associadas para significá-las em seu projeto de vida de forma consciente, de modo a desenvolver um estilo de vida mais ativo, adotando práticas de cuidado com o corpo e com a saúde."
                },
                {
                  "codigo": "ESP66",
                  "descricao": "Compreender os conceitos de nutrição, suplementação, produtos anabolizantes, alimentação saudável e suas relações de consumo, sustentabilidade e discursos midiáticos para a construção de um posicionamento crítico e a adoção de hábitos saudáveis."
                },
                {
                  "codigo": "ESP67",
                  "descricao": "Conhecer o conceito de imagem corporal, sua forma de desenvolvimento e construção, compreender os padrões de beleza e a diversidade corporal e analisar, de forma crítica, os discursos midiáticos apresentados através das manifestações artísticas, linguísticas e desportivas e sua relação com os transtornos relacionados com a imagem corporal, de modo a ressignificar suas práticas corporais na promoção do autoconhecimento e do autocuidado com a saúde para subsidiar suas escolhas para seu projeto de vida."
                },
                {
                  "codigo": "ESP68",
                  "descricao": "Experimentar novos processos de autoconhecimento através de técnicas do Yoga. Identificar as práticas yogues, a cultura oriental e suas influências na cultura brasileira, bem como suas origens históricas e mitológicas para desenvolvimento de um caminho de autoconhecimento, autocontrole, compreensão e respeito a si mesmo e ao outro."
                },
                {
                  "codigo": "ESP69",
                  "descricao": "Empregar conhecimentos linguísticos, metodológicos e socioculturais, na Língua Espanhola, para a elaboração de pré-projetos e/ou projetos (de iniciação científica, por exemplo), cartas de intenção, relatos de experiências, a fim de ampliar as possibilidades de intercâmbios estudantis, de acesso a universidades estrangeiras, de estágios profissionais e da realização de quaisquer outros projetos de vida."
                },
                {
                  "codigo": "ESP70",
                  "descricao": "Desenvolver a performance argumentativa, por meio da interação com diferentes contextos de uso da Língua Espanhola (debates, seminários, fóruns, plenárias, simulações da ONU a exemplo da SiINUS), com o objetivo de conhecer, conviver, trabalhar e serem um meio mais tolerante, inclusivo, colaborativo e pacífico."
                },
                {
                  "codigo": "ESP71",
                  "descricao": "Construir textos multimidiáticos (blogs, jornais, canais online, revistas digitais) que divulguem conteúdos de interesse dos estudantes e experiências exitosas nas comunidades escolar e local, para promover interação entre elas e ampliar a competência comunicacional na Língua Espanhola."
                }
              ]
            },
            {
              "Unidade_Tematica": "LÍNGUA ESPANHOLA EM CONTEXTOS DE CULTURA DIGITAL",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "ESP72",
                  "descricao": "Analisar as tecnologias da comunicação e da informação na vida pessoal e social dos jovens, associando-as ao desenvolvimento de conhecimentos científicos, às linguagens que lhes dão suporte, aos processos de produção e aos problemas que se propõem solucionar, no intuito de adequar as produções aos contextos sociais em que estejam inseridos, formando cidadãos munidos de reflexão social."
                },
                {
                  "codigo": "ESP73",
                  "descricao": "Planejar o uso das diversas plataformas de ferramentas digitais, a partir de uma participação fundamentada e ética, quanto à criação cultural para o engajamento social, propiciando uma visão crítica do indivíduo."
                },
                {
                  "codigo": "ESP74",
                  "descricao": "Apreciar formas contemporâneas de publicidade em contexto digital, bem como peças de campanhas publicitárias e políticas, debatendo os valores e as representações de situações, grupos e configurações sociais veiculadas, desconstruindo estereótipos, destacando estratégias de engajamento e viralização e explicando os mecanismos de persuasão utilizados e os efeitos de sentido provocados pelas escolhas feitas em termos de elementos e recursos de diferentes linguagens."
                },
                {
                  "codigo": "ESP75",
                  "descricao": "Operar, de forma compartilhada, práticas culturais e sociais de diferentes temáticas apoiadas em meios digitais atualmente existentes, com a finalidade de valorizar a participação cultural coletiva, fomentando a prática da inserção do indivíduo no ato de criação crítico-social."
                },
                {
                  "codigo": "ESP76",
                  "descricao": "Analisar os diferentes gêneros audiovisuais e cinematográficos e suas relações com as linguagens artísticas, verbais e esportivas (documentário, videoarte, videoclipe, animação), a fim de produzir conhecimentos da Área de Linguagens com os recursos e as estéticas digitais, considerando as produções do contexto escolar e do entorno."
                },
                {
                  "codigo": "ESP77",
                  "descricao": "Examinar a relação das diversas produções artísticas, verbais e corporais da Área de Linguagens com o desenvolvimento digital e tecnológico para interpretar seus contextos sociais, políticos, históricos e contemporâneos (Semana de Arte Moderna de 1922, antropofagia, arte moderna e pós-moderna, artistas, poetas, performers, grupos teatrais e musicais brasileiros)."
                },
                {
                  "codigo": "ESP78",
                  "descricao": "Analisar, em plataformas digitais ou em outros recursos analógicos e afins, os Festivais de Música Popular Brasileira (1965-1985) e outras composições no período da Ditadura Militar, para criar conexões com outros gêneros e estilos artísticos, textuais e musicais de diferentes tempos e espaços da historiografia musical do Brasil com o mundo (tropicalismo, bossa nova, MPB, moda de viola e emboladas, samba, batalha de rima, lives)."
                },
                {
                  "codigo": "ESP79",
                  "descricao": "Avaliar o uso de aplicativos, protocolos e softwares utilizados para promoção de atividades físicas, propiciando uma visão crítica acerca dos objetivos e das metas idealizados."
                },
                {
                  "codigo": "ESP80",
                  "descricao": "Utilizar testes e avaliações físicas, principalmente os relacionados à saúde, para compreender os benefícios no organismo humano, nas capacidades psíquicas, fisiológicas, motoras e afetivas, para adoção de um estilo de vida que leve em consideração a promoção da atividade física."
                },
                {
                  "codigo": "ESP81",
                  "descricao": "Avaliar criticamente o processo histórico dos jogos eletrônicos, preconceitos, estereótipos e relações de poder, com a finalidade de desenvolver diferentes modos de participação e intervenção social."
                },
                {
                  "codigo": "ESP82",
                  "descricao": "Explorar as tecnologias digitais dirigidas à atividade física, conhecidas como Exergames, ou interface de esforço, compreendendo sua abrangência, seus princípios, suas funcionalidades e seus objetivos, e utilizá-las de forma crítica, ética, criativa e adequada à construção do seu conhecimento sobre o tema."
                },
                {
                  "codigo": "ESP83",
                  "descricao": "Analisar diferentes gêneros digitais (tradutores online, dicionários virtuais, mensagens instantâneas), com o objetivo de acessar a informação e ampliar a capacidade de comunicação, na Língua Espanhola, por meio de ambientes virtuais."
                },
                {
                  "codigo": "ESP84",
                  "descricao": "Explorar diferentes plataformas digitais que propiciem o acesso ao acervo artístico-literário internacional, a fim de ampliar repertório e conhecer expoentes mundiais nos cenários culturais da Língua Espanhola (música, teatro, literatura, arte)."
                },
                {
                  "codigo": "ESP85",
                  "descricao": "Desenvolver recursos digitais (aplicativos, sistemas, gráficos para mapeamentos de dados), utilizando a Língua Espanhola, de modo a contribuir, de forma criativa e significativa, com o aprimoramento de questões relacionadas ao bem-estar da comunidade na qual o estudante está inserido."
                }
              ]
            }
          ]
        },
        "Eletivas_Orientadas": {
          "definicao": "As Eletivas Orientadas são unidades curriculares de duração semestral, com carga horária definida conforme a intencionalidade pedagógica, nas quais os estudantes serão matriculados de acordo com suas escolhas, porém de maneira orientada.",
          "oferta": "Essas Unidades Curriculares serão disponibilizadas aos estudantes ao longo de todo o Ensino Médio, a partir de um catálogo construído pelas Instituições Educacionais e aprovado pela sua mantenedora.",
          "planejamento": "As Eletivas Orientadas devem ser planejadas em função de um ou mais Eixos Estruturantes, estando organizadas de acordo com a temática a ser abordada e em consonância com as DCNEM, com os referenciais para elaboração dos itinerários formativos e com o Currículo em Movimento da Educação Básica do Distrito Federal.",
          "finalidade": "Devem possibilitar tanto o aprofundamento quanto o acompanhamento das aprendizagens que ainda não foram adequadamente alcançadas pelo estudante.",
          "formatos_e_tematicas": "O estudante indicará as Eletivas Orientadas que pretende cursar, as quais poderão ser ofertadas no formato de projetos, oficinas, clubes, monitorias, núcleo de estudos, incubadoras, estágios, entre outras."
        },
        "Trilhas_de_Aprendizagens": {
          "definicao": "As Trilhas de Aprendizagem são compostas por uma sequência de quatro unidades curriculares e possuem a duração total de quatro semestres, cursadas a partir do terceiro.",
          "finalidade": "Possibilita o aprofundamento progressivo das aprendizagens em uma área do conhecimento.",
          "organizacao": "Cada unidade deve ser focada em um eixo estruturante, de modo que, ao final do Ensino Médio, o estudante tenha percorrido os quatro eixos.",
          "escolha_do_estudante": "As trilhas são de livre escolha do estudante, mas ele deverá se matricular em ao menos uma delas, no 3º semestre.",
          "sequencia_dos_eixos": "Investigação Científica (3º semestre), Processos Criativos (4º semestre), Mediação e Intervenção Sociocultural (5º semestre) e Empreendedorismo (6º semestre).",
          "certificacao": "Para efeito de conclusão e certificação do Ensino Médio, o estudante deverá ter cursado e concluído, necessariamente, uma trilha de aprendizagem."
        },
        "Objetivos_Gerais_dos_Itinerarios_Formativos": [
          {
            "Eixo_Estruturante": "Investigação Científica",
            "Objetivos_de_Aprendizagem": [
              {
                "codigo": "IFG01",
                "descricao": "Reconhecer e compreender elementos e relações da natureza e da sociedade, individuais e coletivos, presentes na vida cotidiana e no mundo do trabalho como fontes de dados para a investigação científica."
              },
              {
                "codigo": "IFG02",
                "descricao": "Aplicar metodologias científicas para a geração de informações estratégicas, analisando sua relevância e utilidade na formulação de soluções para os problemas cotidianos."
              },
              {
                "codigo": "IFG03",
                "descricao": "Avaliar e desenvolver soluções teóricas e práticas aos desafios ambientais, econômicos, políticos e socioculturais, sendo capaz de representá-las e divulgá-las por meio de diferentes mídias com o uso de elementos textuais, gráficos, figurativos e imagéticos."
              }
            ]
          },
          {
            "Eixo_Estruturante": "Processos Criativos",
            "Objetivos_de_Aprendizagem": [
              {
                "codigo": "IFG04",
                "descricao": "Reconhecer e compreender a diversidade como fonte e objeto do processo criativo e produtora de sentidos importantes para construção de uma cultura da paz, com tolerância, integração e harmonia."
              },
              {
                "codigo": "IFG05",
                "descricao": "Integrar e aplicar soluções criativas em diferentes situações da vida cotidiana, do mundo do trabalho e na superação de conflitos ambientais, econômicos, políticos e socioculturais."
              },
              {
                "codigo": "IFG06",
                "descricao": "Desenvolver habilidades relacionadas ao pensar e fazer criativo para sua aplicação social, ambiental, científica, laboral e artística."
              }
            ]
          },
          {
            "Eixo_Estruturante": "Mediação e Intervenção Sociocultural",
            "Objetivos_de_Aprendizagem": [
              {
                "codigo": "IFG07",
                "descricao": "Compreender a relevância do diálogo qualificado para a solução de conflitos socioambientais e construção de alternativas democráticas que valorizem as identidades, as diversidades e os direitos humanos."
              },
              {
                "codigo": "IFG08",
                "descricao": "Aplicar a criatividade, o conhecimento científico e a capacidade de argumentação para promover o respeito à dignidade humana e buscar soluções consensuadas na defesa da diversidade, no combate ao preconceito e para construção da cultura da paz."
              },
              {
                "codigo": "IFG09",
                "descricao": "Criar e desenvolver propostas materiais e imateriais para o fortalecimento do diálogo, da solidariedade, do respeito aos valores humanos no fortalecimento da diversidade sociocultural e ambiental."
              }
            ]
          },
          {
            "Eixo_Estruturante": "Empreendedorismo",
            "Objetivos_de_Aprendizagem": [
              {
                "codigo": "IFG010",
                "descricao": "Compreender a ação empreendedora como um campo de aplicação dos conhecimentos teóricos e práticos, de criatividade e de diálogo para o desenvolvimento da confiança, da proatividade e do autoconhecimento."
              },
              {
                "codigo": "IFG011",
                "descricao": "Aplicar o autoconhecimento, o planejamento e a organização para fortalecer a empatia, o espírito de colaboração e a integração da vida escolar ao mundo do trabalho."
              },
              {
                "codigo": "IFG012",
                "descricao": "Planejar e desenvolver o seu projeto de vida, valorizando a diversidade de saberes e as vivências culturais para a tomada de decisões com escolhas alinhadas ao exercício da cidadania, durante e além do período escolar."
              }
            ]
          }
        ],
        "Itinerarios_aplicados": {
          "Linguagens_e_suas_Tecnologias": [
            {
              "Eixo_Estruturante": "Investigação Científica",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "LGGO1IF",
                  "descricao": "Examinar a estrutura, a organização e as relações de sentido presentes em discursos, empregando estratégias de investigação científica para aprofundar conhecimentos acerca de diversas manifestações culturais modernas e contemporâneas, em língua pátria e/ou estrangeira, perpassando diferentes formas de linguagem, a fim de ampliar o repertório científico-cultural para o desenvolvimento de um olhar crítico, ético e sensível à diversidade de formas de expressão artística e literária."
                },
                {
                  "codigo": "LGGO2IF",
                  "descricao": "Utilizar informações acerca da língua pátria e/ou de língua estrangeira, abrangendo as respectivas produções literárias, artísticas e corporais, bem como a multiplicidade de manifestações sociais que emergem de grupos culturais diversos, a fim de elaborar argumentos que sustentem hipóteses sobre a estrutura, o funcionamento e as intencionalidades de discursos variados, além de posicionar-se de forma crítica, sensível, ética e propositiva diante das diferentes linguagens."
                },
                {
                  "codigo": "LGGO3IF",
                  "descricao": "Formular hipóteses acerca do contexto histórico, do desenvolvimento e dos elementos estruturantes de diversas línguas e linguagens, avaliando as relações de poder presentes em seus usos em diversas mídias, suas influências nas relações humanas e no comportamento social, artístico, corpóreo e linguístico."
                }
              ]
            },
            {
              "Eixo_Estruturante": "Processos Criativos",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "LGGO4IF",
                  "descricao": "Reconhecer produtos e/ou processos de criação e recepção - linguístico-literários, artísticos, desportivos e culturais -, a fim de aprofundar conhecimentos sobre os variados usos das linguagens, bem como sobre a multiplicidade de expressões individuais e/ou coletivas, posicionando-se de forma ética e tolerante em relação à diversidade do patrimônio cultural local, regional, nacional e/ou internacional."
                },
                {
                  "codigo": "LGGO5IF",
                  "descricao": "Utilizar recursos expressivos presentes em diversas linguagens, ampliando repertório acerca de manifestações linguísticas, corporais, estéticas e culturais, mobilizando esses conhecimentos para engajar-se em iniciativas criativas de interesse individual e/ou coletivo."
                },
                {
                  "codigo": "LGGO6IF",
                  "descricao": "Desenvolver estratégias inovadoras e éticas para resolver desafios do cotidiano, mobilizando conhecimentos e recursos de diversas linguagens, com o propósito de desconstruir estereótipos e outras formas de preconceito."
                }
              ]
            },
            {
              "Eixo_Estruturante": "Mediação e Intervenção Sociocultural",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "LGGO7IF",
                  "descricao": "Interpretar desafios socioculturais e ambientais cuja superação possa ocorrer por meio de intervenções centradas em práticas que valorizem a diversidade de manifestações culturais e sociais; delineando soluções capazes de contribuir com a qualidade de vida da comunidade e a preservação do meio ambiente."
                },
                {
                  "codigo": "LGGO8IF",
                  "descricao": "Organizar repertório individual sobre as diversas linguagens, por meio de estratégias de mediação e intervenção sobre questões de ordem sociocultural, aprimorando as relações da vida em sociedade, as possibilidades de fruição cultural coletiva e o respeito à diversidade e ao meio ambiente."
                },
                {
                  "codigo": "LGGO9IF",
                  "descricao": "Analisar ações de mediação e intervenção sociocultural e ambiental, mobilizando conhecimentos sobre as diversas linguagens e concebendo soluções viáveis para questões sociais e ambientais."
                }
              ]
            },
            {
              "Eixo_Estruturante": "Empreendedorismo",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "LGG10IF",
                  "descricao": "Entender de que forma o repertório pessoal acerca das diversas linguagens pode contribuir com a materialização de projetos de interesse individual e/ou coletivo, desenvolvendo estratégias éticas e sustentáveis para concretizá-los."
                },
                {
                  "codigo": "LGG11IF",
                  "descricao": "Organizar repertório pessoal acerca das diversas linguagens, favorecendo a escolha de conhecimentos que contribuam para o planejamento de iniciativas e/ou empreendimentos de interesse individual e/ou coletivo; fomentando a participação juvenil e a iniciativa empreendedora."
                },
                {
                  "codigo": "LGG12IF",
                  "descricao": "Desenvolver ações vinculadas a projetos individuais e/ou coletivos, estruturando iniciativas empreendedoras que proponham soluções para desafios pessoais, socioculturais e ambientais."
                }
              ]
            }
          ],
          "Matematica_e_suas_Tecnologias": [
            {
              "Eixo_Estruturante": "Investigação Científica",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "MATO1IF",
                  "descricao": "Investigar situações-problema, selecionando os conhecimentos matemáticos relevantes e elaborando modelos para sua representação."
                },
                {
                  "codigo": "MATO2IF",
                  "descricao": "Testar hipóteses levantadas de variáveis que interferem na explicação ou na resolução de uma situação-problema, avaliando a adequação da linguagem de determinado modelo matemático, em termos de possíveis limitações, eficiência e possibilidades de generalização."
                },
                {
                  "codigo": "MATO3IF",
                  "descricao": "Sistematizar informações, com base em estudos e/ou pesquisas, sobre a contribuição matemática na explicação de fenômenos de natureza científica, social, profissional, cultural, de processos tecnológicos, reconhecendo pontos de vista diversos para posicionar-se com argumentação consistente, fazendo uso de diferentes mídias para a apresentação de conclusões."
                }
              ]
            },
            {
              "Eixo_Estruturante": "Processos Criativos",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "MATO04IF",
                  "descricao": "Reconhecer conceitos matemáticos, por meio de fruição, vivências e reflexão critica, que têm relação com produtos e/ou processos criativos, a fim de compreender a contribuição da Matemática para a resolução de problemas sociais e para o desenvolvimento de processos tecnológicos."
                },
                {
                  "codigo": "MATOS1IF",
                  "descricao": "Selecionar intencionalmente recursos relacionados ao conhecimento matemático, de modo a comunicar com precisão suas ações, reflexões, constatações, interpretações, bem como seus argumentos para resolver situações-problema de natureza diversa."
                },
                {
                  "codigo": "MATO6IF",
                  "descricao": "Propor novas abordagens e estratégias para o enfrentamento de situações reais, de forma ética, criativa e inovadora, utilizando conhecimentos matemáticos associados ao domínio de operações e relações simbólicas e formais."
                }
              ]
            },
            {
              "Eixo_Estruturante": "Mediação e Intervenção Sociocultural",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "MATOTIF",
                  "descricao": "Identificar questões socioculturais e ambientais que utilizem conhecimentos e habilidades matemáticas como subsídio para a tomada de decisões."
                },
                {
                  "codigo": "MATOSIF",
                  "descricao": "Mobilizar conhecimentos e recursos matemáticos para propor ações individuais e/ou coletivas de mediação e intervenção sobre problemas socioculturais e ambientais."
                },
                {
                  "codigo": "MATOSIF",
                  "descricao": "Propor estratégias de mediação e intervenção na solução de problemas de natureza sociocultural e ambiental que tenham relação com a Matemática, utilizando recursos e conhecimentos matemáticos."
                }
              ]
            },
            {
              "Eixo_Estruturante": "Empreendedorismo",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "MAT10IF",
                  "descricao": "Selecionar conhecimentos e recursos matemáticos para desenvolver um projeto pessoal ou um empreendimento produtivo."
                },
                {
                  "codigo": "MAT11IF",
                  "descricao": "Desenvolver projetos (pessoais e/ou produtivos) articulados com o projeto de vida, utilizando conhecimentos matemáticos."
                },
                {
                  "codigo": "MAT12IF",
                  "descricao": "Avaliar as diversas formas de relação entre os conhecimentos e recursos da Matemática e, também, a influência desses para concretizar projetos pessoais ou produtivos, levando em consideração as tecnologias e os impactos socioambientais."
                }
              ]
            }
          ],
          "Ciencias_da_Natureza_e_suas_Tecnologias": [
            {
              "Eixo_Estruturante": "Investigação Científica",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "CNO1IF",
                  "descricao": "Reconhecer a Ciência como uma atividade humana coletiva, historicamente construída e fundamentada em métodos estruturados, cujo objetivo é a compreensão do ordenamento e do funcionamento da natureza."
                },
                {
                  "codigo": "CNO2IF",
                  "descricao": "Discutir e testar conhecimentos e modelos científicos em busca de evidências para validação de hipóteses, respeitando diretrizes de segurança, bioética e respeito aos direitos humanos."
                },
                {
                  "codigo": "CNO3IF",
                  "descricao": "Elaborar hipóteses, procedimentos de coleta de dados, modelos explicativos e conclusões para processos investigativos, construindo textos, gráficos, tabelas e outras formas de representação para comunicar informações de interesse científico e tecnológico."
                }
              ]
            },
            {
              "Eixo_Estruturante": "Processos Criativos",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "CNO4IF",
                  "descricao": "Reconhecer a Ciência como um processo criativo, dinâmico e transformador, presente no cotidiano das pessoas, que é capaz de promover a cultura da paz, com tolerância, integração e harmonia."
                },
                {
                  "codigo": "CN05IF",
                  "descricao": "Utilizar recursos e processos químicos, físicos e biológicos, respaldados por conhecimentos teóricos e práticos, para elaborar propostas para a solução de problemas."
                },
                {
                  "codigo": "CNO6IF",
                  "descricao": "Projetar e aplicar soluções para problemas reais, considerando os contextos ambientais, éticos e socioculturais, identificando seus impactos e prevendo desdobramentos."
                }
              ]
            },
            {
              "Eixo_Estruturante": "Mediação e Intervenção Sociocultural",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "CNO7IF",
                  "descricao": "Reconhecer o conhecimento científico como instrumento de compreensão e solução de questões ambientais, sanitárias e socioculturais, a partir de procedimentos éticos, bioéticos, de respeito aos direitos humanos e à sustentabilidade."
                },
                {
                  "codigo": "CNO8IF",
                  "descricao": "Selecionar e aplicar recursos e procedimentos científicos para combater o preconceito, as ideias de eugenia e superioridade étnico-racial, bem como avaliar criticamente tecnologias que ameacem a construção de uma cultura da paz, como armamentos nucleares, químicos e biológicos."
                },
                {
                  "codigo": "CNO9IF",
                  "descricao": "Propor alternativas sustentáveis para a melhoria da qualidade de vida de pessoas e comunidades, garantindo seus direitos humanos e acesso a oportunidades iguais, considerando suas especificidades e diversidades regional, étnica, religiosa, sexual e sociocultural."
                }
              ]
            },
            {
              "Eixo_Estruturante": "Empreendedorismo",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "CN10IF",
                  "descricao": "Entender a importância da tecnologia para a sociedade humana, que historicamente utiliza processos e insumos biológicos para a subsistência, a promoção do crescimento e a geração de bem-estar."
                },
                {
                  "codigo": "CN11IF",
                  "descricao": "Avaliar alternativas tecnológicas, selecionando as de melhor custo-benefício, considerando seus impactos ao ambiente, às comunidades locais e à saúde humana, tanto física quanto mental."
                },
                {
                  "codigo": "CN12IF",
                  "descricao": "Desenvolver soluções sustentáveis para questões cotidianas, a partir de saberes e tecnologias que favoreçam o exercício da cultura, da cidadania, bem como o desenvolvimento da sociedade, considerando suas necessidades por produção de alimentos, geração de energia e manutenção da saúde."
                }
              ]
            }
          ],
          "Ciencias_Humanas_e_Sociais_Aplicadas": [
            {
              "Eixo_Estruturante": "Investigação Científica",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "CHSAIFO1",
                  "descricao": "Investigar fenômenos e processos de natureza histórica, social, econômica, filosófica, ambiental, política e cultural, presentes no cotidiano como fontes de dados para a análise, interpretação, crítica e proposição científica."
                },
                {
                  "codigo": "CHSAIFO2",
                  "descricao": "Testar, a partir de dados investigados em âmbito local, regional, nacional e/ou global, procedimentos e linguagens adequados à pesquisa científica com vistas à (re)formulação de conhecimentos, apresentando conclusões práticas e/ou teóricas, com a utilização de diferentes mídias."
                },
                {
                  "codigo": "CHSAIFO3",
                  "descricao": "Sistematizar informações com base em pesquisa crítica (documental, bibliográfica, exploratória, de campo, experimental, etc.) a fim de se obter conhecimentos confiáveis."
                }
              ]
            },
            {
              "Eixo_Estruturante": "Processos Criativos",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "CHSAIF04",
                  "descricao": "Reconhecer a diversidade de formas e recursos criativos na multiplicidade de discursos e práticas constituintes da realidade social."
                },
                {
                  "codigo": "CHSAIF05",
                  "descricao": "Selecionar formas e recursos criativos identificados em diferentes contextos da vida cotidiana (local, regional, nacional e global) para uma vida ativa, contributiva e melhoria dos âmbitos individual e coletivo."
                },
                {
                  "codigo": "CHSAIF06",
                  "descricao": "Propor soluções inovadoras em busca da superação de problemas relacionados às singularidades e suas especificidades de ordens histórica, social, econômica, filosófica, política e cultural."
                }
              ]
            },
            {
              "Eixo_Estruturante": "Mediação e Intervenção Sociocultural",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "CHSAIF07",
                  "descricao": "Identificar, na diversidade de contextos históricos e geográficos e de modos de vida dos grupos humanos, práticas, crenças, valores e normas relacionadas às diferentes identidades socioculturais."
                },
                {
                  "codigo": "CHSAIF08",
                  "descricao": "Mobilizar recursos e conhecimentos de natureza sociocultural e ambiental, a partir das demandas locais, regionais, nacionais e/ou globais, segundo as especificidades das diversidades e coletividades."
                },
                {
                  "codigo": "CHSAIF09",
                  "descricao": "Propor ações de mediação e intervenção sobre questões adversas envolvidas na vida pública e cotidiana, por meio de projetos contributivos à construção de um espaço de convivência democrática e respeitosa dos direitos e da dignidade humana."
                }
              ]
            },
            {
              "Eixo_Estruturante": "Empreendedorismo",
              "Objetivos_de_Aprendizagem": [
                {
                  "codigo": "CHSAIF10",
                  "descricao": "Avaliar oportunidades, saberes, técnicas e recursos de processos produtivos nas perspectivas de análise e de reflexão sobre as culturas do empreendedorismo, da autogestão e do trabalho associado, em âmbito local, regional, nacional e/ou global."
                },
                {
                  "codigo": "CHSAIF11",
                  "descricao": "Selecionar estratégias criativas, relacionadas às ações de natureza social, econômica, ambiental, política e cultural, de forma articulada às diversidades de projetos de vida, com o intuito de construir projetos pessoais e/ou associativos."
                },
                {
                  "codigo": "CHSAIF12",
                  "descricao": "Desenvolver projetos por meio da elaboração e concretização de ações que coadunem com as práticas democráticas de cidadania, de sustentabilidade e de Direitos Humanos."
                }
              ]
            }
          ],
          "Educacao_Profissional_e_Tecnologica": {
            "Descricao": "A Educação Profissional e Tecnológica (EPT) integra-se aos diferentes níveis e modalidades de educação e às dimensões do trabalho, da ciência, da tecnologia e da cultura, constituindo modalidade da Educação Básica e Superior, articulada à EJA, Educação Especial e EaD. Destina-se à formação profissional de jovens e adultos, preparando-os para a vida, para o mundo do trabalho e para a continuidade dos estudos.",
            "Cursos_Profissionais_Tecnicos_de_Nivel_Medio": {
              "descricao": "Cursos com cargas horárias de 800, 1.000 ou 1.200 horas, que conferem habilitação profissional técnica de nível médio, com diploma de validade nacional, registrados no SISTEC, podendo ser ofertados de forma integrada, concomitante ou subsequente ao Ensino Médio."
            },
            "Cursos_de_Qualificacao_Profissional_FIC": {
              "descricao": "Cursos de Qualificação Profissional ou Formação Inicial e Continuada (FIC), com carga horária mínima de 160 horas, reconhecidos por certificado, voltados à inserção ou reinserção no mundo do trabalho."
            },
            "Principios_Orientadores": [
              "formação integral do estudante, garantindo articulação entre a formação no Ensino Médio e a formação técnica específica",
              "pleno desenvolvimento para a vida social e profissional, com formação voltada para o fortalecimento de valores cidadãos",
              "respeito aos conhecimentos prévios dos sujeitos da aprendizagem, promovendo a indissociabilidade entre educação e prática social",
              "indissociabilidade entre teoria e prática no processo de ensino e aprendizagem",
              "envolvimento das múltiplas dimensões do eixo tecnológico do curso e das ciências e tecnologias a ele vinculadas",
              "articulação com os arranjos produtivos locais, com as demandas da comunidade escolar e com o desenvolvimento socioeconômico-ambiental dos territórios",
              "reconhecimento da diversidade das pessoas com deficiência, transtornos globais do desenvolvimento e altas habilidades, em regime de acolhimento ou internação e em regime de privação de liberdade",
              "reconhecimento das identidades étnico-raciais dos povos indígenas, dos quilombolas e das identidades de gênero, bem como da diversidade de orientação sexual, das populações do campo e das pessoas em situação de rua",
              "autonomia da Instituição Educacional na construção e revisão de seu Projeto Político Pedagógico (PPP), desde que respeitados o processo participativo, a legislação e as normas educacionais",
              "descrição de perfis profissionais de conclusão de curso que contemplem conhecimentos, competências e saberes profissionais requeridos pela natureza do trabalho, pelo desenvolvimento tecnológico e pelas demandas sociais, econômicas e ambientais",
              "colaboração entre os entes federados, incluindo parcerias com as entidades da sociedade civil, visando à melhoria dos indicadores educacionais"
            ],
            "Trabalho_como_Principio_Educativo": "Compreende o trabalho como elemento formativo que supera a dicotomia entre trabalho manual e intelectual, integrando formação humanística e conhecimentos específicos, promovendo autonomia reflexiva, ética e cidadania.",
            "Pesquisa_como_Principio_Pedagogico": "A pesquisa orienta os processos formativos, estimulando o pensamento crítico, a prática investigativa, a integração entre ciência e prática e a superação da fragmentação do conhecimento por meio da interdisciplinaridade.",
            "Planejamento_Pedagogico": {
              "etapas": [
                "Diagnóstico situacional",
                "Definição de objetivos e metas",
                "Construção de plano ou projeto",
                "Monitoramento e avaliação"
              ]
            },
            "Organizacao_Curricular": {
              "pressupostos": [
                "historicidade da ocupação profissional",
                "adequação à vocação produtiva regional",
                "definição do perfil profissional de conclusão",
                "aproveitamento contínuo de estudos",
                "flexibilidade curricular",
                "interdisciplinaridade",
                "critérios de avaliação",
                "condições técnicas e de pessoal"
              ]
            },
            "Organizacao_da_Oferta_EPT": {
              "Organizacao_Formas_Modalidades_de_Oferta": {
                "contexto": "Articulação com o Ensino Médio",
                "instituicoes": {
                  "rede_de_ensino": {
                    "descricao": "Instituições educacionais da rede de ensino do Sistema de Ensino do Distrito Federal."
                  },
                  "instituicoes_parceiras": {
                    "descricao": "Instituições parceiras devidamente autorizadas, conforme legislações vigentes."
                  }
                },
                "tipos_de_cursos": {
                  "Cursos_Tecnicos_de_Nivel_Medio": {
                    "publico": [
                      "estudantes matriculados no Ensino Médio",
                      "egressos do Ensino Médio"
                    ],
                    "referencial_normativo": "Catálogo Nacional de Cursos Técnicos",
                    "estrutura": {
                      "organizacao": "eixos tecnológicos",
                      "articulacao": "Formação Geral Básica",
                      "carga_horaria": "mínima definida no CNCT"
                    }
                  },
                  "Qualificacao_Profissional_ou_FIC": {
                    "denominacao_e_parametros": {
                      "referenciais": [
                        "Guia Nacional de Cursos FIC",
                        "Classificação Brasileira de Ocupações"
                      ],
                      "criterios": [
                        "denominação",
                        "carga horária",
                        "escolaridade",
                        "perfil profissional"
                      ]
                    },
                    "relacao_com_cursos_tecnicos": {
                      "tipo": "saída intermediária",
                      "descricao": "Pode integrar a matriz curricular dos cursos técnicos de nível médio."
                    },
                    "certificacao": {
                      "tipo": "certificado",
                      "condicao": "conclusão do curso conforme normativas do DF"
                    }
                  }
                },
                "organizacao_curricular": {
                  "descricao": "Cada tipo de curso possui organização curricular própria, em conformidade com as legislações vigentes."
                }
              }
            },
            "Formas_de_Oferta": {
              "tipos": [
                "Integrada ao Ensino Médio",
                "Concomitante ao Ensino Médio"
              ]
            },
            "Possibilidades_de_Oferta": {
              "modalidades": [
                "Forma Presencial",
                "Educação a Distância (EaD)"
              ]
            },
            "Registro_no_Sistema_Nacional_de_Informacoes_da_EPT": {
              "descricao": "Os cursos técnicos de nível médio devem ser registrados no Sistema Nacional de Cursos Técnicos vigente, garantindo a validade nacional dos diplomas."
            },
            "Formalizacao_de_Parcerias": {
              "descricao": "As parcerias com instituições possibilitam a oferta de itinerários formativos, a emissão de certificações e o fortalecimento da gestão democrática, visando à permanência, aprendizagem e protagonismo dos estudantes."
            },
            "Objetivos_de_Aprendizagem": [
              {
                "Eixo_Estruturante": "Investigação Científica",
                "Objetivos_de_Aprendizagem": [
                  {
                    "codigo": "EPT01IF",
                    "descricao": "Compreender os fenômenos cotidianos que permeiam a vida pessoal, familiar e comunitária, o ambiente escolar e o mundo do trabalho, por meio de metodologias participativas e de problematização."
                  },
                  {
                    "codigo": "EPTO2IF",
                    "descricao": "Aplicar conhecimentos construídos pelas ciências para entender suas relações com os saberes inerentes ao mundo do trabalho."
                  },
                  {
                    "codigo": "EPTO3IF",
                    "descricao": "Produzir novas informações a partir do conhecimento da realidade vivenciada, visando à solução de situações-problema."
                  }
                ]
              },
              {
                "Eixo_Estruturante": "Processos Criativos",
                "Objetivos_de_Aprendizagem": [
                  {
                    "codigo": "EPTO4IF",
                    "descricao": "Reconhecer conceitos e expressões do processo criativo e sua relevância na vida e no mundo do trabalho."
                  },
                  {
                    "codigo": "EPTO5IF",
                    "descricao": "Demonstrar senso crítico e criativo a partir da análise da realidade e das exigências do mundo do trabalho."
                  },
                  {
                    "codigo": "EPTO6IF",
                    "descricao": "Desenvolver a capacidade de articular o pensar e o agir diante das oportunidades do processo de aprendizagem."
                  }
                ]
              },
              {
                "Eixo_Estruturante": "Mediação e Intervenção Sociocultural",
                "Objetivos_de_Aprendizagem": [
                  {
                    "codigo": "EPTO7IF",
                    "descricao": "Entender deveres, direitos e responsabilidades individuais e coletivas nas questões sociais e ambientais."
                  },
                  {
                    "codigo": "EPTO8IF",
                    "descricao": "Demonstrar capacidade de atuação em equipe, respeitando a diversidade e os preceitos éticos."
                  },
                  {
                    "codigo": "EPTO9IF",
                    "descricao": "Analisar estratégias e métodos para mediação de conflitos nas relações sociais e de trabalho."
                  }
                ]
              },
              {
                "Eixo_Estruturante": "Empreendedorismo",
                "Objetivos_de_Aprendizagem": [
                  {
                    "codigo": "EPTO10IF",
                    "descricao": "Reconhecer fundamentos e características comportamentais relacionadas ao empreendedorismo."
                  },
                  {
                    "codigo": "EPTO11IF",
                    "descricao": "Categorizar instrumentais para formulação e gerenciamento de projetos."
                  },
                  {
                    "codigo": "EPTO12IF",
                    "descricao": "Desenvolver capacidade empreendedora por meio da elaboração de projetos alinhados ao contexto produtivo."
                  }
                ]
              }
            ]
          }
        }
      }
    }
  }
}
